import 'dart:convert';
/// verses : [{"id":1,"verse_number":1,"verse_key":"1:1","hizb_number":1,"rub_el_hizb_number":1,"ruku_number":1,"manzil_number":1,"sajdah_number":null,"text_uthmani":"بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ","page_number":1,"juz_number":1,"words":[{"id":1,"position":1,"audio_url":"wbw/001_001_001.mp3","char_type_name":"word","text_uthmani":"بِسْمِ","page_number":1,"line_number":2,"text":"بِسْمِ","translation":{"text":"In (the) name","language_name":"english"},"transliteration":{"text":"bis'mi","language_name":"english"}},{"id":2,"position":2,"audio_url":"wbw/001_001_002.mp3","char_type_name":"word","text_uthmani":"ٱللَّهِ","page_number":1,"line_number":2,"text":"ٱللَّهِ","translation":{"text":"(of) Allah","language_name":"english"},"transliteration":{"text":"l-lahi","language_name":"english"}},{"id":3,"position":3,"audio_url":"wbw/001_001_003.mp3","char_type_name":"word","text_uthmani":"ٱلرَّحْمَـٰنِ","page_number":1,"line_number":2,"text":"ٱلرَّحْمَـٰنِ","translation":{"text":"the Most Gracious","language_name":"english"},"transliteration":{"text":"l-raḥmāni","language_name":"english"}},{"id":4,"position":4,"audio_url":"wbw/001_001_004.mp3","char_type_name":"word","text_uthmani":"ٱلرَّحِيمِ","page_number":1,"line_number":2,"text":"ٱلرَّحِيمِ","translation":{"text":"the Most Merciful","language_name":"english"},"transliteration":{"text":"l-raḥīmi","language_name":"english"}},{"id":5,"position":5,"audio_url":null,"char_type_name":"end","text_uthmani":"١","page_number":1,"line_number":2,"text":"١","translation":{"text":"(1)","language_name":"english"},"transliteration":{"text":null,"language_name":"english"}}],"audio":{"url":"AbdulBaset/Mujawwad/mp3/001001.mp3","segments":[[0,1,0,960],[1,2,970,1420],[2,3,1430,2670],[3,4,2680,6210]]},"translations":[{"id":1065242,"resource_id":106,"text":"Ша сов къинхетаме<sup foot_note=111781>1</sup> а‚ къинхетаме<sup foot_note=111782>2</sup> а волчу Делан цIарца."},{"id":325425,"resource_id":56,"text":"奉至仁至慈的真主之名"}],"tafsirs":[{"id":67135,"resource_id":165,"text":"<p>অনন্ত করুণাময় পরম দয়ালু আল্লাহর নামে (আরম্ভ করছি)।</p><p>'বিসমিল্লাহ'র পূর্বে 'আক্বরাউ' 'আবদাউ' অথবা 'আতলু' ফে'ল (ক্রিয়া) উহ্য আছে। অর্থাৎ, আল্লাহর নাম নিয়ে পড়ছি অথবা শুরু করছি কিংবা তেলাঅত আরম্ভ করছি। প্রত্যেক গুরুত্বপূর্ণ কাজ আরম্ভ করার পূর্বে 'বিসমিল্লাহ' পড়ার প্রতি তাকীদ করা হয়েছে। সুতরাং নির্দেশ করা হয়েছে যে, খাওয়া, যবেহ করা, ওযু করা এবং সহবাস করার পূর্বে 'বিসমিল্লাহ' পড়। অবশ্য ক্বুরআনে করীম তেলাঅত করার সময় 'বিসমিল্লাহির রাহমানির রাহীম' পড়ার পূর্বে 'আউযু বিল্লাহি মিনাশ্শায়ত্বানির রাজীম' পড়াও অত্যাবশ্যক। মহান আল্লাহ বলেছেন, \"অতএব যখন তুমি ক্বুরআন পাঠ করবে, তখন বিতাড়িত শয়তান থেকে আল্লাহর আশ্রয় প্রার্থনা কর।\" <em>(সূরা নাহল ১৬:৯৮ আয়াত)।</em></p>"},{"id":178095,"resource_id":381,"text":""}]},{"id":2,"verse_number":2,"verse_key":"1:2","hizb_number":1,"rub_el_hizb_number":1,"ruku_number":1,"manzil_number":1,"sajdah_number":null,"text_uthmani":"ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَـٰلَمِينَ","page_number":1,"juz_number":1,"words":[{"id":1130,"position":1,"audio_url":"wbw/001_002_001.mp3","char_type_name":"word","text_uthmani":"ٱلْحَمْدُ","page_number":1,"line_number":3,"text":"ٱلْحَمْدُ","translation":{"text":"All praises and thanks","language_name":"english"},"transliteration":{"text":"al-ḥamdu","language_name":"english"}},{"id":1131,"position":2,"audio_url":"wbw/001_002_002.mp3","char_type_name":"word","text_uthmani":"لِلَّهِ","page_number":1,"line_number":3,"text":"لِلَّهِ","translation":{"text":"(be) to Allah","language_name":"english"},"transliteration":{"text":"lillahi","language_name":"english"}},{"id":1132,"position":3,"audio_url":"wbw/001_002_003.mp3","char_type_name":"word","text_uthmani":"رَبِّ","page_number":1,"line_number":3,"text":"رَبِّ","translation":{"text":"the Lord","language_name":"english"},"transliteration":{"text":"rabbi","language_name":"english"}},{"id":1133,"position":4,"audio_url":"wbw/001_002_004.mp3","char_type_name":"word","text_uthmani":"ٱلْعَـٰلَمِينَ","page_number":1,"line_number":3,"text":"ٱلْعَـٰلَمِينَ","translation":{"text":"of the universe","language_name":"english"},"transliteration":{"text":"l-ʿālamīna","language_name":"english"}},{"id":1134,"position":5,"audio_url":null,"char_type_name":"end","text_uthmani":"٢","page_number":1,"line_number":3,"text":"٢","translation":{"text":"(2)","language_name":"english"},"transliteration":{"text":null,"language_name":"english"}}],"audio":{"url":"AbdulBaset/Mujawwad/mp3/001002.mp3","segments":[[0,1,1700,2490],[1,2,2500,3880],[2,3,3890,4910],[3,4,4920,10000]]},"translations":[{"id":1065243,"resource_id":106,"text":"Хастам<sup foot_note=111783>1</sup>бу Далла<sup foot_note=111784>2</sup>– Iаламийн<sup foot_note=111785>3</sup>Дена<sup foot_note=111786>4</sup>,"},{"id":325575,"resource_id":56,"text":"一切赞颂全归真主，众世界 的主，"}],"tafsirs":[{"id":171860,"resource_id":381,"text":"<p><b>  أَعُوْذُ بِاللّٰهِ (আঊযুবিল্লাহ)-এর প্রাসঙ্গিক আলোচনা</b></p><p>কুমন্ত্রণাদানকারী শয়তান হতে মহান আল্লাহর নিকট আশ্রয় চাওয়া প্রতিটি মু’মিন-মুসলিমের একান্ত কর্তব্য। কারণ আদম (আঃ)-কে সৃষ্টি করার পর হতে শয়তান মানুষের অনিষ্ট করার জন্য প্রতিজ্ঞাবদ্ধ।</p><p>এ ব্যাপারে মহান আল্লাহ পবিত্র কুরআনে বলেন:</p><p class='arabic uthmani'>(لَأَقْعُدَنَّ لَهُمْ صِرَاطَكَ الْمُسْتَقِيْمَ)</p><p>(শয়তান বলল:) “আমি (বানী আদমকে বিভ্রান্ত করার জন্য) আপনার সরল পথে অবশ্যই বসে থাকব।”(সূরা আ‘রাফ ৭:১৬) তাই শয়তানের অনিষ্ট থেকে বেঁচে থাকার জন্য الاستعاذة বা আঊযুবিল্লাহ পাঠ করার গুরুত্ব অপরিসীম।</p><p>আঊযুবিল্লাহ পাঠ: আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَقُلْ رَّبِّ أَعُوْذُ بِكَ مِنْ هَمَزٰتِ الشَّيٰطِيْنِ وَأَعُوْذُ بِكَ رَبِّ أَنْ يَّحْضُرُوْنِ) ‏</p><p>“বল:‎ হে আমার প্রতিপালক! আমি তোমার কাছে আশ্রয় প্রার্থনা করি সকল শয়তানের প্ররোচনা হতে, আর হে আমার প্রতিপালক! আমি তোমার আশ্রয় প্রার্থনা করি আমার নিকট তাদের উপস্থিতি হতে।”(সূরা মু’মিনুন ২৩:৯৭-৯৮)</p><p>আল্লাহ তা‘আলা আরো বলেন:</p><p class='arabic uthmani'>(وَإِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطٰنِ نَزْغٌ فَاسْتَعِذْ بِاللّٰهِ ط إِنَّه۫ هُوَ السَّمِيْعُ الْعَلِيْمُ)</p><p>“যদি শয়তানের কুমন্ত্রণা তোমাকে প্ররোচিত করে তবে আল্লাহর আশ্রয় প্রার্থনা কর। তিনি সর্বশ্রোতা, সর্বজ্ঞ।”(সূরা হা-মীম সিজদাহ ৪১:৩৬)</p><p>উপরোক্ত আয়াতগুলোর আলোকে বলা যায়: সাধারণত আঊযুবিল্লাহ পাঠ করা মুস্তাহাব। ইমাম ইবনু কাসীর (রহঃ) বলেন: কুরআন তেলাওয়াতের শুরুতে আঊযুবিল্লাহ পাঠ করা ওয়াজিব। তিনি দলীলস্বরূপ নিম্নোক্ত আয়াতটি পেশ করেছেন:</p><p class='arabic uthmani'>(فَإِذَا قَرَأْتَ الْقُرْاٰنَ فَاسْتَعِذْ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ)</p><p>“যখন কুরআন পাঠ করবে তখন অভিশপ্ত শয়তান হতে আল্লাহর আশ্রয় চাও।”(সূরা নাহল ১৬:৯৮)</p><p>উক্ত আয়াতে فَاسْتَعِذْ (আশ্রয় চাও) আদেশসূচক শব্দ ব্যবহার করা হয়েছে যা আবশ্যকের অর্থ প্রদান করে। অতএব কুরআন পাঠের সময় আঊযুবিল্লাহ পাঠ করা ওয়াজিব।</p><p>সালাতে আঊযুবিল্লাহ পাঠ: সালাতের মধ্যে ছানা পাঠের পর কিরাআত পড়ার আগে আ‘ঊযুবিল্লাহ পড়া ওয়াজিব। (তাফসীর ইবনে কাসীর)</p><p>সাহাবী আবূ সাঈদ খুদরী (রাঃ) নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হতে বর্ণনা করেন যে, তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সালাতে দাঁড়িয়ে ইসতিফতাহ (ছানা) পড়ার পর পড়তেন:</p><p class='arabic uthmani'>(أَعُوذُ بِاللّٰهِ السَّمِيْعِ الْعَلِيْمِ مِنَ الشَّيْطَانِ الرَّجِيْمِ مِنْ هَمْزِهِ، وَنَفْخِهِ، وَنَفْثِهِ)</p><p>অর্থাৎ সর্বশ্রোতা ও সর্বজ্ঞ আল্লাহর নিকট শয়তানের খোঁচা, ফুৎকার ও প্ররোচনা হতে আশ্রয় প্রার্থনা করছি। (আবূ দাঊদ হা: ৭৭৫, সহীহ)</p><p>ইমাম তিরমিযী (রহঃ) বলেন: এ ব্যাপারে এই হাদীসটি অধিক প্রসিদ্ধ। ইমাম শাওকানী (রহঃ) বলেন: এটি সালাতের প্রথম রাকাতে কিরাআতের পূর্বে বলতে হবে। (নাইলুল আওতার: ২/১৯৭-১৯৮)</p><p>উল্লেখ্য যে, ফরয-সুন্নাত ও নফল যে কোন সালাতে শুধু প্রথম রাকাতে নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ছানা ও আঊযুবিল্লাহ পড়তেন, আর বাকি রাকাতগুলোতে পড়তেন না। (সহীহ মুসলিম হা: ১৩৮২, মিশকাত পৃঃ ৭৮)</p><p>আঊযুবিল্লাহ-কে বিসমিল্লাহ-এর মতই চুপে চুপে পড়তে হবে। কারণ সরবে পড়ার স্বপক্ষে কোন প্রমাণ পাওয়া যায় না। নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ও সাহাবীগণ কখনো সরবে পড়েননি।</p><p>আঊযুবিল্লাহ পাঠের ফযীলত: সুলাইমান বিন সূরাদ (রাঃ) হতে বর্ণিত, তিনি বলেন, দু’ব্যক্তি নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিকটে গালাগালি করছিল। এতে একজন খুব রেগে গেল এবং তাঁর চেহারা লাল হয়ে গেল, শিরা-উপশিরাগুলো মোটা হয়ে গেল। অতঃপর নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন:</p><p class='arabic uthmani'>(إِنِّيْ لَأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ مَا بِهِ؛ أعُوذُ باللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ)</p><p>নিশ্চয়ই আমি এমন একটি বাক্য জানি, যদি সে ঐ বাক্যটি পড়ে তাহলে তার হতে ঐ জিনিস চলে যাবে যা তার সাথে আছে (অর্থাৎ রাগ চলে যাবে)। আর সেই বাক্যটি হল,</p><p class='arabic uthmani'>أعُوْذُ باللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ</p><p>(সহীহ বুখারী হা: ৬১১৫, ৬০৪৮, ৩২৮২, সহীহ মুসলিম হা: ২৬১০ )</p><p>অন্য এক হাদীসে উসমান বিন আবুল আস সাকাফী (রাঃ) হতে বর্ণিত যে, তিনি নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর নিকট এসে বললেন, হে আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)! নিশ্চয়ই শয়তান আমার মাঝে এবং আমার সালাতের মাঝে অন্তরাল সৃষ্টি করে দেয়। অর্থাৎ আমাকে সন্দেহে ফেলে দেয় (এতে আমার করণীয় কী?)। রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ঐ লোকটিকে বললেন,</p><p class='arabic uthmani'>ذَاكَ شَيْطَانٌ يُقَالُ لَهُ خِنْزَبٌ فَإِذَا أَحْسَسْتَهُ فَتَعَوَّذْ بِاللّٰهِ مِنْهُ وَاتْفِلْ عَلَي يَسَارِكَ ثَلاَثًا</p><p>এ হলো ঐ শয়তান যার নাম “খিনজাব”। অতএব যখন তাকে অনুভব করবে তখন আল্লাহ তা‘আলার নিকট তার হতে আশ্রয় প্রার্থনা করবে এবং বাম দিকে তিনবার হালকা থুথু ফেলবে। সাহাবী বলেন, আমি তা-ই করলাম। ফলে আল্লাহ তা‘আলা আমার হতে ঐ শয়তানকে দূরে সরিয়ে নিলেন। (সহীহ মুসলিম হা: ২২০, মুসনাদ আহমাদ হা: ১৭৪৪০)</p><p><b>নামকরণ: </b></p><p>اَلْفَاتِحَةُ (আল-ফাতিহা) অর্থ সূচনা, ভূমিকা, প্রারম্ভিকা ইত্যাদি। পবিত্র কুরআনুল কারীম এ সূরা দ্বারা শুরু করা হয়েছে বিধায় এর নামকরণ করা হয়েছে সূরা আল ফাতিহা, অনুরূপভাবে সালাতের কিরাআতও শুরু হয় এ সূরা দ্বারা।</p><p>এ সূরার আরো অনেক নাম রয়েছে- তন্মধ্যে কয়েকটি নিম্নরূপ:</p><p><b> ১. اَلسَّبْعُ الْمَثَانِيُّ </b></p><p>আস্সাবউল মাসানী বা সাতটি অধিক পঠিতব্য আয়াত: (তিরমিযী হা: ৩১২৪, আবূ দাঊদ হা: ১৪৫৭, সহীহ) আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَلَقَدْ اٰتَيْنٰكَ سَبْعًا مِّنَ الْمَثَانِيْ)</p><p>“আমি তোমাকে সাবআ মাসানি (বারবার পঠিত সাতটি আয়াত) প্রদান করেছি।”(সূরা হিজর ১৫:৮৭)</p><p><b> ২. اَلصَّلَاةُ আস্ সালাত: </b> রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>قَسَمْتُ الصَّلَاةَ بَيْنِيْ وَبَيْنَ عَبْدِيْ نِصْفَيْنِ</p><p>আমি সালাতকে (সূরা ফাতিহাকে) আমার ও আমার বান্দার মাঝে দু’ভাগে ভাগ করেছি। (সহীহ মুসলিম হা: ৯০৪, ৯০৬)</p><p><b> ৩. اَلرُّقْيَةُ আর রুক্ইয়াহ বা ঝাড়ফুঁক: </b> রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সাহাবীদের কৃত সূরা ফাতিহার মাধ্যমে ঝাড়ফুঁক সমর্থন করে বলেন:</p><p class='arabic uthmani'>وَمَا يُدْرِيْكَ أَنَّهَا رُقْيَةٌ</p><p>তুমি কী করে জানলে এটি ঝাড়ফুঁকের সূরা? (সহীহ বুখারী হা: ২২৭৬)</p><p><b> ৪. أُمُّ الْقُرْاٰنِ উম্মুল কুরআন বা কুরআনের মা/মূল: </b> রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন: যে ব্যক্তি সালাত আদায় করল অথচ উম্মুল কুরআন (সূরা ফাতিহা) পাঠ করল না তা অসম্পূর্ণ। (সহীহ মুসলিম হা: ৩৯৫)</p><p><b> ৫. فَاتِحَةُ الْكِتَابِ  ফাতিহাতুল কিতাব বা কুরআনের ভূমিকা: </b> রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন: যে ব্যক্তি ফাতিহাতুল কিতাব (সূরা ফাতিহা) পাঠ করবে না তার সালাত হবে না। (সহীহ বুখারী হা: ৭৫৬, সহীহ মুসলিম হা: ৩৯৪) এছাড়াও এ সূরাকে سُوْرَةُ الْحَمْدِ (সূরাতুল হাম্দ বা প্রশংসার সূরা), سُوْرَةُ الْمَسْأَلَةِ  (সূরাতুল মাসআলাহ বা আবেদনের সূরা), اَلْقُرْاٰنُ الْعَظِيْمُ (আল কুরআনুল আযীম), سُوْرَةُ الشِّفَاءِ (সূরাতুশ শিফা বা আরোগ্যের সূরা) ইত্যাদি বলা হয়ে থাকে।</p><p><b>অবতরণের সময়কাল: </b></p><p>সূরা ফাতিহাহ অবতরণের সময়কাল সম্পর্কে ইবনু আব্বাস (রাঃ) ও কাতাদাহ (রহঃ) বলেন- এটি মক্কায় অবতীর্ণ, আবূ হুরায়রা (রাঃ) ও মুজাহিদ (রহঃ) বলেন- মদীনায় অবতীর্ণ, আবার কেউ বলেন- দু’বার অবতীর্ণ হয়েছে; একবার মক্কায় এবং আরেকবার মদীনায়।</p><p>তবে সবচেয়ে বেশি বিশুদ্ধ ও গ্রহণযোগ্য মত হল এ সূরা মক্কায় অবতীর্ণ হয়েছে। কারণ আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَلَقَدْ اٰتَيْنٰكَ سَبْعًا مِّنَ الْمَثَانِيْ)</p><p>“আমি তোমাকে সাবআ মাসানি (বারবার পঠিত সাতটি আয়াত) প্রদান করেছি।”(সূরা হিজর ১৫:৮৭) এ আয়াতে সাবাআ মাসানী দ্বারা সূরা ফাতিহাকে বুঝানো হয়েছে। আর এ আয়াতটি মক্কায় অবতীর্ণ হয়েছে। সুতরাং সূরা ফাতিহা মক্কায় অবতীর্ণ হওয়াটাই অধিক যুক্তিযুক্ত। (আল্লাহ তা‘আলাই সবচেয়ে ভাল জানেন)</p><p><b>সূরা ফাতিহার গুরুত্ব ও তাৎপর্য: </b></p><p>সূরা ফাতিহার গুরুত্বের ব্যাপারে অসংখ্য সহীহ হাদীস পাওয়া যায়, সাহাবী উবাদা বিন সামিত (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন:</p><p class='arabic uthmani'>لَا صَلَاةَ لِمَنْ لَمْ يَقْرَأْ بِفَاتِحَةِ الْكِتَابِ</p><p>যে ব্যক্তি সালাতে সূরা ফাতিহা পড়ল না তার সালাত হল না। (সহীহ বুখারী হা: ৭৫৬, সহীহ মুসলিম হা: ৩৯৪)</p><p>অনুরূপ বিশিষ্ট সাহাবী আবূ হুরায়রা (রাঃ) হতে বর্ণিত, নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন: “যে ব্যক্তি সূরা ফাতিহা ছাড়াই সালাত আদায় করল তার সালাত অসম্পূর্ণ।”তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এ অসম্পূর্ণ কথাটি তিন বার বললেন। আবূ হুরায়রা (রাঃ)-কে জিজ্ঞাসা করা হল যে, আমরা তো ইমামের পেছনেও সালাত আদায় করি, তখন আমরা কী করব? তিনি বললেন: তোমরা তা (সূরা ফাতিহা) ইমামের পেছনে মনে মনে পাঠ করবে। (সহীহ মুসলিম হা: ৩৯৫)</p><p>উবাদা বিন সামিত (রাঃ) বলেন: একদা আমরা নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর পিছনে ফজরের সালাত পড়লাম। সালাতে তাঁর কিরাআত ভারী মনে হল, সালাত শেষে জিজ্ঞাসা করলেন: মনে হয় তোমরা ইমামের পেছনে থাকা অবস্থায় কিরাআত পাঠ কর? আমরা বললাম: হ্যাঁ, পাঠ করি। নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন: তোমরা সূরা ফাতিহা ব্যতীত আর অন্য কিছু পাঠ কর না, কেননা যে ব্যক্তি সূরা ফাতিহা পাঠ করে না তার সালাত হয় না। (আবূ দাঊদ হা: ৮২৩, তিরমিযী হা: ৩১১, নাসাঈ হা: ৯২১, হাসান)</p><p>উল্লিখিত হাদীসগুলো থেকে এ কথা পরিষ্কার হয় যে, কুরআন পাঠের সময় মনোযোগ দিয়ে শ্রবণ করা ও চুপ থাকার নির্দেশ (সূরা আ’রাফ ৭:২০৪)-এর সাথে হাদীসগুলোর কোন বিরোধ নেই। কারণ, জাহরী (সরবে কিরাআত বিশিষ্ট) সালাতগুলোতে মুক্তাদী ইমামের কুরআন পাঠ মনোযোগসহকারে শুনবে এবং সূরা ফাতিহা ব্যতীত ইমামের সাথে কুরআন পাঠ করবে না। নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যেখানে নিজে ইমাম, সাহাবীগণ মুক্তাদী, আর তাঁরা এমন সালাত আদায় করলেন যার কিরাআত ছিল সরবে সে অবস্থাকে কেন্দ্র করে নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর ফায়সালা হল সূরা ফাতিহা পাঠ ছাড়া সালাতই হবে না। অতএব এ বিষয়ে কোন অস্পষ্টতা ও দ্বিমতের অবকাশ নেই। এছাড়াও সূরা আরাফের ২০৪ নং আয়াত অবতীর্ণ হয় মক্কায় আর সূরা ফাতিহা পাঠের নির্দেশ হয় মদীনায় সুতরাং শরীয়তের নীতিমালা অনুযায়ী পরবর্তী নির্দেশ অবশ্যই প্রাধান্য পায়। আরো বলা যায় যে, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর ওপর সূরা আরাফের উক্ত আয়াত নাযিল হয়েছে আর তিনিই ইমামের পেছনে সূরা ফাতিহা পড়ার নির্দেশ দিয়েছেন, সুতরাং এর পর আর কোন অস্পষ্টতা ও বিরোধ থাকতে পারে না।</p><p><b> সূরা ফাতিহার ফযীলত: </b></p><p>সূরা আল-ফাতিহা পবিত্র কুরআনুল কারীমের বিশেষ গুরুত্বপূর্ণ এবং সর্বপ্রথম পূর্ণাঙ্গ অবতীর্ণ হওয়া একটি সূরা। এর ফযীলত সম্পর্কে অনেক বর্ণনা রয়েছে। যেমন,</p><p>১. প্রসিদ্ধ সাহাবী আবূ হুরায়রা (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন: আল্লাহ তা‘আলা বলেন, সূরা ফাতিহাকে আমার ও আমার বান্দার মধ্যে দু’ভাগে ভাগ করেছি এবং বান্দা যা চায় তা তার জন্য। যখন বান্দা বলে:</p><p class='arabic uthmani'>(الْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ)</p><p>তখন আল্লাহ তা‘আলা বলেন, আমার বান্দা আমার প্রশংসা করছে। যখন বান্দা বলে:</p><p class='arabic uthmani'>(الرَّحْمٰنِ الرَّحِيْمِ)</p><p>তখন আল্লাহ তা‘আলা বলেন, আমার বান্দা আমার গুণগান করছে। যখন বান্দা বলে:</p><p class='arabic uthmani'>(مَالِكِ يَوْمِ الدِّيْنِ)</p><p>তখন আল্লাহ তা‘আলা বলেন, আমার বান্দা আমার মর্যাদা বর্ণনা করছে। যখন বান্দা বলে:</p><p class='arabic uthmani'>(إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ)</p><p>আল্লাহ তা‘আলা বলেন, এটি আমার ও বান্দার মধ্যে সমান এবং বান্দা যা চায় তা তার জন্য। যখন বান্দা বলে:</p><p class='arabic uthmani'>(اِھْدِنَا الصِّرَاطَ الْمُسْتَقِیْمَﭕﺫ صِرَاطَ الَّذِیْنَ اَنْعَمْتَ عَلَیْھِمْﺃ غَیْرِ الْمَغْضُوْبِ عَلَیْھِمْ وَلَا الضَّا۬لِّیْنَﭖﺟ)</p><p>তখন আল্লাহ তা‘আলা বলেন, এটি আমার ও বান্দার মধ্যে সমান এবং বান্দা যা চায় তা তা জন্য। (সহীহ মুসলিম হা: ৯০৪, ৯০৬)</p><p>২. অন্য হাদীসে বলা হয়েছে জিবরীল (আঃ) একদা রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বললেন: আপনি এমন দু’টি নূরের (আলোর) সুসংবাদ গ্রহণ করুন যে দু’টি নূর আপনি ব্যতীত পূর্ববর্তী কোন নাবীকে দেয়া হয়নি। একটি সূরাতুল ফাতিহাহ এবং অন্যটি সূরাতুল বাকারাহ-এর শেষ দু’টি আয়াত। (সহীহ মুসলিম হা: ১৯১৩, নাসাঈ হা: ৯১২)</p><p>৩. সাহাবী আবূ সাঈদ বিন মুয়াল্লা (রাঃ) বলেন, একদা আমি সালাতে ছিলাম, আমাকে রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ডাকলেন। আমি তাঁর ডাকে সাড়া দিলাম না। আমি সালাত শেষ করে তাঁর কাছে এলাম। তিনি বললেন: আমি যখন তোমাকে ডাকলাম তখন কিসে তোমাকে আমার ডাকে সাড়া দিতে বাধা দিয়েছে? তিনি (আবূ সাঈদ) বলেন, আমি বললাম- হে আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমি সালাতে ছিলাম। তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, আল্লাহ তা‘আলা কি একথা বলেননি:</p><p class='arabic uthmani'>(یٰٓاَیُّھَا الَّذِیْنَ اٰمَنُوا اسْتَجِیْبُوْا لِلہِ وَلِلرَّسُوْلِ اِذَا دَعَاکُمْ لِمَا یُحْیِیْکُمْﺆ),</p><p>“হে ঈমানদারগণ, তোমরা আল্লাহ ও তাঁর রাসূলের ডাকে সাড়া দাও যখন তোমাদের তিনি জীবন সঞ্চারক বস্তুর দিকে ডাকেন।”(সূরা আনফাল ৮:২৪) অতঃপর রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকে বললেন, আমি তোমাকে মাসজিদ থেকে বের হবার পূর্বেই কুরআনের সবচেয়ে বড় সূরা শিক্ষা দেব। সাহাবী বললেন- এ বলে রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমার হাত ধরলেন। যখন তিনি মাসজিদ থেকে বের হতে যাচ্ছিলেন, তখন আমি বললাম, হে আল্লাহর রাসূল আপনি তো বলেছিলেন, আমাকে কুরআনের সবচেয়ে বড় সূরা শিক্ষা দেবেন? তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন হ্যাঁ। তা হল-</p><p class='arabic uthmani'>(الْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ)</p><p>“সমস্ত প্রশংসা একমাত্র আল্লাহর জন্য যিনি জগতসমূহের প্রতিপালক।”এটি সাবআ মাসানি, কুরআনুল আযীম যা আমাকে দেয়া হয়েছে। (সহীহ বুখারী হা: ৪৪৭৪)</p><p>৪. সাহাবী আবূ সাঈদ খুদরী (রাঃ) হতে বর্ণিত, তিনি বলেন, একদা নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর একদল সাহাবী কোন এক সফরে যাত্রা করেন। তারা এক আরব গোত্রে পৌঁছে তাদের মেহমান হতে চাইলেন। কিন্তু তারা তাদের মেহমানদারী করতে অস্বীকার করল। সে গোত্রের সরদার সাপে দংশিত হল। লোকেরা তার আরোগ্যের জন্য সব ধরনের চেষ্টা করল। কিন্তু কিছুতেই কোন উপকার হল না। তখন তাদের কেউ বলল, ঐ কাফেলা যারা এখানে অবতরণ করেছে হয়তো তাদের কাছে কিছু পাওয়া যেতে পারে। তারা তাদের নিকট গেল এবং বলল, হে যাত্রীদল! আমাদের সরদারকে সাপ দংশন করেছে, আমরা সবরকমের চেষ্টা করেছি, কিন্তু কোন উপকার হচ্ছে না। তোমাদের কারো নিকট কিছু আছে কি? তাদের (সাহাবীদের) একজন বলল, হ্যাঁ। আল্লাহ তা‘আলার শপথ! আমি ঝাড়ফুঁক করতে পারি। আমরা তোমাদের মেহমানদারী কামনা করেছিলাম, কিন্তু তোমরা আমাদের মেহমানদারী করনি। কাজেই আমি তোমাদের ঝাড়ফুঁক করব না, যে পর্যন্ত না তোমরা আমাদের জন্য পারিশ্রমিক নির্ধারণ কর। তখন তারা একপাল বকরী প্রদানের শর্তে তাদের সাথে চুক্তিবদ্ধ হল। তারপর তিনি গিয়ে</p><p class='arabic uthmani'>(الْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ)</p><p>সূরা ফাতিহা পড়ে তার চিকিৎসা করলেন। ফলে আল্লাহ তা‘আলার ইচ্ছায় সে বন্ধনমুক্ত হল এবং সে এমনভাবে চলতে লাগল যেন তার কোন কষ্টই ছিল না......হাদীসের শেষ পর্যন্ত। (সহীহ বুখারী হা: ২২৭৬, ৫০০৭, ৫৭৩৬, ৫৭৪৯, সহীহ মুসলিম হা: ২২০১, আহমাদ হা: ১১৩৯৯)</p><p>৫. উবাই বিন কাব (রাঃ) বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: উম্মুল কুরআনের (সূরা ফাতিহার) ন্যায় তাওরাত ও ইঞ্জিলে আল্লাহ তা‘আলা কোন কিছুই অবতীর্ণ করেননি। এ উম্মুল কুরআন সাবআ মাসানি। (তিরমিযী হা: ৩১২৫, নাসায়ী হা: ৯১৪, আল-জামি আল-সহীহ হা: ৫৫৬০, শাইখ আলবানী সহীহ বলেছেন)</p><p>কেউ কেউ সূরা ফাতিহাকে কবর যিয়ারত করতে মৃত ব্যক্তির পাশে বসে ও কবরে মৃত ব্যক্তির মাথার দিকে দাঁড়িয়ে পাঠ করে থাকে। এগুলো তাদের মনগড়া কাজ, যা বিদ‘আত। সুতরাং তা অবশ্যই বর্জনীয়।</p><p><b>১-২ নং আয়াতের তাফসীর: </b></p><p>বিসমিল্লাহর পূর্বে أَقْرَأُ (আক্রাউ) বা أَبْدَأُ (আব্দাউ) এমন একটি ক্রিয়া গোপন রয়েছে যার অর্থ আল্লাহ তা‘আলার নামে শুরু করছি বা তেলাওয়াত করছি।</p><p>“বিসমিল্লাহ” এর প্রাসঙ্গিক আলোচনা: ‘বিসমিল্লাহির রহমানির রহীম’প্রত্যেক সূরার স্বতন্ত্র একটি আয়াত, নাকি প্রত্যেক সূরার আয়াতের অংশ, না কেবল সূরা ফাতিহার একটি আয়াত, না কোন সূরারই স্বতন্ত্র আয়াত নয়; বরং এক সূরা থেকে অন্য সূরাকে পৃথক করার জন্য প্রত্যেক সূরার শুরুতে লেখা হয়েছে? এ বিষয়ে কিছু মতভেদ পরিলক্ষিত হয়। তবে “বিসমিল্লাহির রহমানির রহীম” সূরা নামলের ৩০ নং আয়াতের অংশ এ ব্যাপারে সকলে একমত।</p><p>১. সাহাবী আলী (রাঃ), ইবনু আব্বাস (রাঃ), সাঈদ বিন যুবাইর (রাঃ) প্রমুখের মতে এটি সূরা তাওবাহ ব্যতীত প্রত্যেক সূরার শুরুতে একটি পৃথক আয়াত। তাবেয়ী আব্দুল্লাহ বিন মুবারক এবং ইসহাকও এ মত পোষণ করেছেন।</p><p>২. ইমাম শাফিঈ (রহঃ) এর মতে, এটি শুধু সূরা ফাতিহার আয়াত অন্য সূরার আয়াত নয়।</p><p>৩. আবূ হানিফা ও ইমাম মালেক (রহঃ) এর মতে, এটি সূরা ফাতিহার আয়াত তো নয়ই এমনকি অন্য সূরারও আয়াত নয়। (ইবনে কাসীর, বিসমিল্লাহর তাফসীর)</p><p>তবে সঠিক কথা হলো “বিসমিল্লাহির রাহমানি রাহীম” সূরা নামলের মতই সূরা ফাতিহার একটি আয়াত। আর অন্যান্য সূরার শুরুতে লেখা হয়েছে বরকত হাসিল ও এক সূরা থেকে অপর সূরাকে পৃথক করার জন্য।</p><p>প্রথম দলীল: সাহাবী আবূ হুরায়রা (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন:</p><p class='arabic uthmani'>إِذَا قَرَأْتُمُ الْحَمْدَ لِلّٰهِ فَاقْرَءُوا (بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ) إِنَّهَا أُمُّ الْقُرْآنِ وَأُمُّ الْكِتَابِ وَالسَّبْعُ الْمَثَانِيْ وَ (بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ) إِحْدَاهَا</p><p>যখন তোমরা আল-হামদুল্লিাহ বা সূরা ফাতিহা পাঠ শুরু কর তখন ‘বিসমিল্লাহির রহমানির রহীম’পাঠ কর। কেননা সূরা ফাতিহা কুরআনের মূল, কিতাবের মূল এবং সালাতের মধ্যে বার বার তেলাওয়াত করা সাত আয়াতবিশিষ্ট সূরা। আর ‘বিসমিল্লাহির রহমানির রাহীম’তার একটি আয়াত। (দারাকুতনী হা: ৩৬, সিলসিলা সহীহাহ হা: ১১৮৩)</p><p>দ্বিতীয় দলীল: বিষয় হল বর্তমান বিশ্বে কুরআনুল কারীমের নির্ভরযোগ্য ও গ্রহণযোগ্য লিখিত কপি হল মদীনা মুনাওয়ারায় বাদশাহ ফাহাদ প্রিন্টিং প্রেস হতে মুদ্রিত কুরআনুল কারীম যা খলীফা উসমান (রাঃ) কর্তৃক সংকলিত কপির আদলে করা হয়েছে। সেখানেও বিসমিল্লাহ সূরা ফাতিহার প্রথম আয়াত হিসেবে রয়েছে। অতএব প্রমাণিত হয় “বিসমিল্লাহির রাহমানির রাহীম” সূরা ফাতিহার প্রথম আয়াত। আল্লাহ তা‘আলাই ভাল জানেন।</p><p>“বিসমিল্লাহ” কিভাবে পড়তে হবে? সালাতে “বিসমিল্লাহ...” সশব্দে পড়ার স্বপক্ষে বিশুদ্ধ দলীল না থাকায় সঠিক নিয়ম হল “বিসমিল্লাহির রাহমানির রহীম” নিরবে পড়বে।</p><p>এটাই নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম), চার খলিফা ও সালাফদের থেকে প্রমাণিত। আনাস (রাঃ) বলেন: আমি নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম), আবূ বকর, উমার ও উসমান (রাঃ)-এর পেছনে সালাত আদায় করেছি। তাঁরা কিরাআতের আওয়াজ শুরু করতেন “আল হামদু লিল্লাহি রাব্বিল আলামীন” দ্বারা। (সহীহ বুখারী হা: ৭৪৩)</p><p>অর্থাৎ কোন অবস্থাতেই “বিসমিল্লাহির রাহমানির রহীম” সরবে পড়তেন না। (সহীহ মুসলিম হা: ৩৯৯)</p><p><b> “বিসমিল্লাহ” এর ফযীলত: </b></p><p>১. রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন: যখন তোমাদের কোন ব্যক্তি বাড়িতে প্রবেশকালে ও খাবার গ্রহণ করার সময় আল্লাহ তা‘আলাকে স্মরণ করে অর্থাৎ “বিসমিল্লাহ” বলে, তখন শয়তান (তার সঙ্গীদের) বলে তোমাদের রাত্রি যাপন ও খাবার নেই। আর বাড়িতে প্রবেশকালে আল্লাহ তা‘আলাকে স্মরণ করলে অর্থাৎ “বিসমিল্লাহ” না বললে শয়তান (তার সঙ্গীদের) বলে তোমরা রাত্রি যাপনের স্থান পেয়েছ এবং খাবার গ্রহণ করার সময় আল্লাহ তা‘আলাকে স্মরণ না করলে অর্থাৎ “বিসমিল্লাহ” না বললে শয়তান (তার সঙ্গীদের) বলে, রাত্রি যাপন ও খাবার উভয়টাই পেয়েছ। (আদাবুল মুফরাদ: ১/৪৩৩, সহীহ ইবনু মাযাহ হা: ৩৮৭৭, ইবনে হিব্বান হা: ৮১৯, সহীহ)। সুতরাং প্রত্যেক ভাল কাজের পূর্বে ‘বিসমিল্লাহ’বলা উচিত।</p><p>২. জাবের (রাঃ) হতে বর্ণিত, নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন: ‘বিসমিল্লাহ’বলে তুমি তোমার দরজা বন্ধ কর। কারণ শয়তান বন্ধ দরজা খুলতে পারবে না। ‘বিসমিল্লাহ’বলে বাতি নিভিয়ে দাও, একটু কাঠখণ্ড দিয়ে হলেও ‘বিসমিল্লাহ’বলে পাত্রের মুখ ঢেকে দাও। (সহীহ বুখারী হা: ৩২৮০, সহীহ মুসলিম হা: ২০১২)</p><p>৩. আবূ সাঈদ (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন: যে ব্যক্তি ওযূ করার সময় بِسْمِ اللّٰهِ (বিসমিল্লাহ) পাঠ করে না, তার ওযূ হয় না। (আবূ দাঊদ হা: ১০১, ইবনু মাযাহ হা: ৩৯৭, সহীহ)</p><p>৪. কোন গুরুত্বপূর্ণ লেখনি, পত্র বা বাণীর শুরুতে ‘বিসমিল্লাহির রহমানির রহীম’লেখা উচিত, কারণ এটা নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর নিয়ম ছিল। তিনি যখন রোমের বাদশাহ হিরাক্লিয়াসের কাছে ইসলামের দাওয়াত পত্র লেখেন তখন শুরুতেই লেখেন</p><p class='arabic uthmani'>بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ مِنْ مُحَمَّدٍ عَبْدِ اللّٰهِ وَرَسُوْلِهِ</p><p>‘বিসমিল্লাহির রহমানির রহীম’আল্লাহ তা‘আলার বান্দা ও রাসূল মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর পক্ষ থেকে। (সহীহ বুখারী হা: ৭, সহীহ মুসলিম হা: ৪৫৮)</p><p>উল্লেখ্য যে, “বিসমিল্লাহ” এর পরিবর্তে ৭৮৬ লেখা অমুসলিমদের আবিষ্কার। তাই ৭৮৬ লেখা ও বলা বৈধ নয় বরং হারাম ও গুনাহের কাজ।</p><p>(اَلْحَمْدُ لِلہِ رَبِّ الْعٰلَمِیْنَ)</p><p>‘সমস্ত প্রশংসা একমাত্র আল্লাহর জন্য যিনি জগতসমূহের প্রতিপালক।’কুরআনের শুরুতেই আল্লাহ তা‘আলা নিজেই নিজের প্রশংসা করেছেন। আর এরূপ নিজেই নিজের প্রশংসা করা একমাত্র আল্লাহ তা‘আলার জন্যই সীমাবদ্ধ। প্রশংসা করা একটি ইবাদত যা শুধু আল্লাহ তা‘আলার সন্তুষ্টির জন্য করতে হবে। এর অনেক ফযীলত বর্ণিত হয়েছে। রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন:</p><p class='arabic uthmani'>أَفْضَلُ الدُّعَاءِ اَلْحَمْدُ لِلّٰهِ</p><p>সর্বোত্তম দু‘আ ‘আল-হামদুলিল্লাহ।’আল্লাহর প্রশংসা করা (তিরমিযী হা: ৩৩৪৩, সহীহ)</p><p>রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আরো বলেন:</p><p class='arabic uthmani'>اَلْحَمْدُ لِلّٰهِ تَمْلَأُ الْمِيْزَانِ</p><p>‘আল হামদুলিল্লাহ (সওয়াবের) পাল্লা পূর্ণ করবে।’(সহীহ মুসলিম হা: ২২৩) বিশ্বজগতের সবাই আল্লাহ তা‘আলার প্রশংসায় পঞ্চমুখ।</p><p>আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَلَهُ الْحَمْدُ فِي السَّمٰوٰتِ وَالْأَرْضِ)</p><p>‘আকাশ ও জমিনে তাঁর জন্যই সকল প্রশংসা।’(সূরা রূম ৩০:১৮)</p><p>আল্লাহ তা‘আলা আরো বলেন:</p><p class='arabic uthmani'>(لَهُ الْحَمْدُ فِي الْأُوْلٰي وَالْاٰخِرَةِ)</p><p>‘দুনিয়াতে ও আখেরাতে তাঁর জন্যই সকল প্রশংসা।’(সূরা কাসাস ২৮:৭০)</p><p>اللّٰهُ (আল্লাহ) হলেন বিশ্বজাহানের প্রতিপালক। “আল্লাহ” তাঁর সত্তাগত নাম। যাকে ‘ইসমে আযম’বলা হয়। তাঁর অন্যান্য নামগুলো এ নামের অনুগামী ও গুণবাচক নাম। এ নাম বিশ্বজাহানের প্রতিপালক আল্লাহ তা‘আলা ছাড়া অন্য কারো জন্য প্রযোজ্য নয়। এ নামের কোন ভাষায় কোন প্রতিশব্দ ও কোন পরিবর্তন নেই এবং এ নামের কোন দ্বিবচন বা বহুবচন নেই। সুতরাং ‘আল্লাহ’নামের অনুবাদ হিসেবে গড, ইশ্বর, ভগবান, খোদা ইত্যাদি বলা বা আল্লাহ তা‘আলাকে ঐ সব নামে নামকরণ করা বা ডাকা যাবে না।</p><p>আজকাল অনেককে দেখা যায় বিভিন্ন মাসজিদে, মাদরাসায়, বাড়িতে, গাড়িতে ইত্যাদি জায়গায় বরকতের জন্য এক পাশে আল্লাহ (اللّٰهُ) অপর পাশে মুহাম্মাদ (مُحَمَّد) লিখে রাখে। এটা নিঃসন্দেহে বিদ‘আত ও আল্লাহ তা‘আলার শানে বেআদবী। কেননা এরূপ পাশাপাশি ‘আল্লাহ ও মুহাম্মাদ’লেখা রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে আল্লাহ তা‘আলার সমান মর্যাদায় স্থান দেয়ার শামিল, যা এক প্রকার শির্ক। সুতরাং এরূপ কখনো বৈধ নয়। রাসূলুল্লাহ বলেন:</p><p class='arabic uthmani'>لاَ تُطْرُونِي، كَمَا أَطْرَتْ النَّصَارَي ابْنَ مَرْيَمَ، فَإِنَّمَا أَنَا عَبْدُهُ، فَقُولُوا عَبْدُ اللّٰهِ، وَرَسُولُهُ</p><p>খ্রিস্টানরা ইবনু মারইয়াম (ঈসা (আঃ))-কে নিয়ে যেমন বাড়াবাড়ি করেছে তোমরা আমাকে নিয়ে তেমন বাড়াবাড়ি করো না। আমি কেবল একজন আল্লাহর বান্দা। সুতরাং তোমরা আমাকে আল্লাহর বান্দা ও তাঁর রাসূল হিসেবেই সম্বোধন কর। (সহীহ  বুখারী হা: ৩৪৪৫)</p><p>কারো জিজ্ঞাসা হতে পারে</p><p class='arabic uthmani'>أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللّٰهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ</p><p>এখানে একই লাইনে  اللّٰهُ  ও مُحَمَّد নাম দু’টি রয়েছে তাহলে কি কালিমা শাহাদাতও ভুল?</p><p>উত্তর: আসলে কালিমা শাহাদাত বা আরো কোন কালিমায় একই লাইনে নাম দু’টি থাকলেও অর্থগত ও ভাবগত কোন সমস্যা নেই, বরং অর্থই স্পষ্ট করে দেয় যে, اللّٰهُ হলেন মা‘বূদ, আর মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হলেন আল্লাহর বান্দা ও রাসূল। এমনকি দেখার সাথে সাথে দর্শক ও পাঠকের কাছে বিষয়টি স্পষ্ট হয়ে যায়। পক্ষান্তরে শুধু  اللّٰهُ ও مُحَمَّد নাম দু’টি যখন উর্ধ্বে সমানভাবে লেখা হয়, তখন ভাবটা যেন এরূপ প্রকাশ হয় যে, আল্লাহ ও মুহাম্মাদ সমান স্থানের, সমান স্তরের এবং সমান মর্যাদার। এমনকি পাঠক ও দর্শক একইভাবে মনে করে ও পাঠ করে। কেউ কারো ঊর্ধ্বে নয়, দু’জনই সমান, নাউযুবিল্লাহ। সুতরাং এ ধরণের চিন্তা ও বিশ্বাস রাখা শির্ক। অতএব তা অবশ্যই বর্জনীয়। আমরা রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে অবশ্যই সকল মানুষের ঊর্ধ্বে স্থান দেব কিন্তু এর অর্থ এ নয় যে, তিনি আল্লাহর সমপর্যায়, নাউযুবিল্লাহ। আল্লাহ তা‘আলা হলেন সকলের ঊর্ধ্বে, তাঁর কোন সমকক্ষ নেই, তিনি এক ও অদ্বিতীয়। আর মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) হলেন তাঁর বান্দা ও রাসূল, তাঁর সৃষ্টি জীব। তিনি মানুষের মাঝে শ্রেষ্ঠ কিন্তু কখনও আল্লাহ তা‘আলার সমপর্যায় নয়। আল্লাহ তা‘আলা আমাদেরকে সঠিক অবস্থানে থাকার তাওফীক দান করুন, আমীন।</p><p class='arabic uthmani'>“رَبِّ الْعَالَمِيْنَ”</p><p>রব্বিল আলামীন- এটি আল্লাহ তা‘আলার গুণবাচক নাম:</p><p>رب শব্দের অর্থ: লালন পালন করা, কোন বস্তুর সকল কল্যাণের প্রতি লক্ষ রেখে পর্যায়ক্রমে সামনে এগিয়ে নিয়ে উন্নতির শিখরে পৌঁছে দেয়া।</p><p>আল্লাহ তা‘আলা যখন মূসা (আঃ)-কে ফির‘আউনের কাছে রবের দাওয়াত দেয়ার জন্য নির্দেশ দিলেন, মূসা (আঃ) তার কাছে দাওয়াত পেশ করলে ফির‘আউন বলল:</p><p class='arabic uthmani'>(فَمَنْ رَّبُّكُمَا يٰمُوْسٰي)</p><p>‘হে মূসা তোমাদের প্রতিপালক কে?’(সূরা ত্বহা ২০:৪৯)</p><p>কারণ ফির‘আউন জানত আমিই মূসাকে লালন-পালন করেছি, ছোট থেকে বড় করেছি। তখন মূসা (আঃ) জবাবে বললেন:</p><p class='arabic uthmani'>(قَالَ رَبُّنَا الَّذِيْ أَعْطٰي كُلَّ شَيْءٍ خَلْقَه۫ ثُمَّ هَدٰي)</p><p>‘‘আমাদের প্রতিপালক তিনি যিনি সকল বস্তুকে সৃষ্টি করেছেন অতঃপর পথপ্রদর্শন করেছেন।’’(সূরা ত্ব-হা ২০:৫০)</p><p>আর اَلْعَالَمِيْنَ শব্দটি عَالَمٌ এর বহুবচন, এতে সপ্ত আকাশ, সপ্ত জমিন ও উভয়ের মাঝে যা কিছু আছে সবই অন্তর্ভুক্ত। ফির‘আউন বলল:</p><p class='arabic uthmani'>(وَمَا رَبُّ الْعٰلَمِيْنَ)</p><p>‘‘রব্বুল আলামীন কে?’’জবাবে মূসা (আঃ) বলেন:</p><p class='arabic uthmani'>(قَالَ رَبُّ السَّمٰوٰتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا)</p><p>‘‘আকাশ, জমিন ও উভয়ের মাঝে যা কিছু আছে সব কিছুর প্রতিপালক।’(সূরা শুয়ারা ২৬:২৩, ২৪) সুতরাং আল্লাহ তা‘আলা আকাশ, জমিন ও মানবসহ সব কিছুর প্রতিপালক। তিনিই সব কিছুর একক স্রষ্টা, একক পালনকারী, একক পরিচালক ও একক অধিকারী, অন্য কেউ নয়।</p><p>এ আয়াত থেকেই আল্লাহ তা‘আলা তাঁর তাওহীদের পরিচয় তুলে ধরেছেন। তাই তাওহীদ সম্পর্কে সংক্ষিপ্ত আলোচনা তুলে ধরা জরুরী।</p><p><b>তাওহীদের পরিচয়ঃ </b></p><p>তাওহীদ শব্দটি মুসলিম সমাজে একটি সুপরিচিত শব্দ হলেও এর সঠিক পরিচয় অনেকের কাছে অজানা। এজন্য বহু মুসলিম ব্যক্তি তাওহীদের বাণীর স্বীকৃতি দেয়া সত্ত্বেও তাওহীদ পরিপন্থী কর্মকান্ডে হাবুডুবু খাচ্ছে। আবার অনেকে তাওহীদের নামে সাধারণ মুসলিমদেরকে ধোঁকা দিচ্ছে।</p><p><b> তাওহীদ এর শাব্দিক অর্থ হলঃ  </b></p><p class='arabic uthmani'>(جَعْلُ الشَّيْئِ وَاحِدًا)</p><p>অর্থাৎ কোন কিছুকে এক করে দেয়া। আল্লাহ তা‘আলাকে যাবতীয় শরীক হতে মুক্ত করে স্বীয় কর্তৃত্ব, গুণাবলী ও অধিকার এক করার নামই হল তাওহীদ।</p><p>তাওহীদ এর পারিভাষিক অর্থঃ নিম্ন বর্ণিত তিনটি বিষয় মনে-প্রাণে বিশ্বাস করা, মৌখিক স্বীকৃতি প্রদান করা এবং বাস্তবে পালন করার নাম তাওহীদ:</p><p>১। সমগ্র বিশ্বের স্রষ্টা, প্রতিপালক, মালিক ও পরিচালক একমাত্র আল্লাহ তা‘আলা, অন্য কেউ নয়।</p><p>২। সৃষ্টি জীবের যাবতীয় ইবাদত বা উপাসনা একনিষ্ঠভাবে একমাত্র আল্লাহ তা‘আলার জন্যই সম্পাদন করা এবং অন্য সকল ব্যক্তি ও বস্তুকে ইবাদাতে আল্লাহ তা‘আলার শরীক না করা এবং সে সবের ইবাদত বা উপাসনা সম্পূর্ণরূপে বর্জন করা।</p><p>৩। পবিত্র কুরআন এবং সহীহ হাদীসে আল্লাহ তা‘আলার যেসব সুন্দর নাম ও পবিত্র গুণাবলী বর্ণিত হয়েছে সেগুলিকে কোন অপব্যাখ্যা, অস্বীকৃতি, বিকৃতি ও সাদৃশ্য স্থাপন ছাড়াই একমাত্র আল্লাহ তা‘আলার জন্যই খাসভাবে সাব্যস্ত করা। (সাবীলুল হুদা ওয়ার রাশাদঃ ১২ পৃষ্ঠা)</p><p><b> তাওহীদ নামে ধোঁকাঃ </b></p><p>তাওহীদ শব্দটি মুসলিম সমাজে একটি সুপরিচিত ও গুরুত্বপূর্ণ শব্দ। পবিত্র কুরআন ও সহীহ হাদীসে যে তাওহীদের বর্ণনা এসেছে বা রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যে তাওহীদ শিক্ষা দিয়েছেন উক্ত বর্ণনাই হলো সেই তাওহীদের আসল বর্ণনা। কিন্তু দুঃখের বিষয় মুসলিম নামধারী বিভিন্ন দল ও মত “তাওহীদ” শব্দটি ব্যবহার করে নিজেদের বাতিল মত ও পথ প্রচার করে যাচ্ছে। অতএব একজন সত্যাগ্রহী মুসলিম ব্যক্তিকে এ সকল ধোঁকা হতে সতর্ক থাকা অতি জরুরী। নিম্নে সংক্ষিপ্তভাবে কয়েকটি দলের তাওহীদী মতবাদ তুলে ধরা হলোঃ</p><p><b> ১। জাহমিয়া সম্প্রদায়ের তাওহীদঃ </b> এ সম্প্রদায়ের নিকট তাওহীদ হল আল্লাহ তা‘আলার নাম, গুণাবলী ও অস্তিত্বকে অস্বীকার করা, শুধুমাত্র স্মৃতিতে আল্লাহ তা‘আলাকে মনে করাই হলো তাদের তাওহীদ।</p><p><b> ২। চরমপন্থী সুফীবাদের তাওহীদঃ </b> এ সম্প্রদায়ের নিকট তাওহীদ হল ওয়াহদাতুল উজুদ অর্থাৎ পৃথিবীর বুকে অস্তিত্বে যা পাওয়া যায় তা সবই আল্লাহ তা‘আলা। আকৃতিতে জিন, ইনসান, শুকুর ও কুকুর যাই হোক না কেন তা মূলত আল্লাহ তা‘আলারই উপস্থিতি। (নাউযুবিল্লাহ)</p><p><b> ৩। মুতাযিলাদের তাওহীদঃ </b> এ সম্প্রদায়ের নিকট আল্লাহ তা‘আলার যাবতীয় গুণাবলীকে অস্বীকার করার নামই হল তাওহীদ। পক্ষান্তরে যে ব্যক্তি আল্লাহ তা‘আলার গুণাবলীকে স্বীকার করে সে তাদের নিকট মুশরিক।</p><p>৪। আরেক দল মনে করে আল্লাহ তা‘আলাকে শুধু সৃষ্টিকর্তা হিসাবে স্বীকার করার নামই তাওহীদ।</p><p>৫। অপর আরেক দল মনে করে আল্লাহ তা‘আলাকে শুধু বিধানদাতা হিসেবে স্বীকার করার নামই তাওহীদ।</p><p>অতএব ইসলামের দাবীদার সকল দলই তাওহীদ এর দাওয়াত দেয় এবং তাওহীদ এর কথা বলে। কিন্তু নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর তাওহীদ কতক দলের নিকট শির্ক, যেমনঃ জাহমিয়া, মুতাযিলা ও চরমপন্থী সুফীবাদের নিকট, আবার নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর শির্ক হল তাদের নিকট তাওহীদ। আল্লাহ তা‘আলা আমাদের সকলকে কুরআন ও সহীহ হাদীসের আলোকে নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর তাওহীদ বুঝার ও মেনে চলার তাওফীক দান করুন, আমীন।</p><p><b> তাওহীদের প্রকারভেদঃ </b></p><p>কুরআন বা হাদীসে তাওহীদ কত প্রকার ও কী কী তা সংখ্যায় উল্লেখ হয়নি। তবে কুরআনের আয়াতগুলোতে তাওহীদের অনুসন্ধান করে দেখলে পাওয়া যায় তাওহীদ তিন প্রকার। নিম্নে সংক্ষেপে প্রকারসমূহ প্রদত্ত হলঃ</p><p class='arabic uthmani'>১। تَوْحِيْدُ الرُّبُوْبِيَّةِ</p><p><b> তাওহীদুর রুবুবিয়্যাহ (প্রতিপালনে আল্লাহ তা‘আলার এককত্ব) : </b> “সমগ্র সৃষ্টি জগতের স্রষ্টা, প্রতিপালক, পরিচালক, পূর্ণ ক্ষমতাশীল ও সার্বভৌমত্বের মালিক হিসেবে একমাত্র আল্লাহ তা‘আলাকে স্বীকৃতি দেয়া ও মনে-প্রাণে বিশ্বাস করার নাম ‘তাওহীদুর রুবুবিয়্যাহ’। যেমন আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(الْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِينَ)</p><p>“সমগ্র বিশ্বের প্রতিপালক আল্লাহর জন্য যাবতীয় প্রশংসা।” এ আয়াতে প্রথম প্রকার তাওহীদ অর্থাৎ সমগ্র বিশ্বের স্রষ্টা, মালিক ও লালন-পালনকর্তা যে একমাত্র আল্লাহ তা‘আলা তার পরিচয় রয়েছে। সুতরাং তাঁরই আনুগত্য করা আমাদের একান্ত কর্তব্য।</p><p class='arabic uthmani'>২। تَوْحِيْدُ الْأُلُوْهِيَّةِ</p><p><b> তাওহীদুল উলুহিয়্যাহ (ইবাদাতে আল্লাহর এককত্ব) : </b> “যাবতীয় ইবাদাতের একক অধিকারী আল্লাহ তা‘আলা এটা বিশ্বাস করতঃ শুধু তাঁরই জন্য যাবতীয় ইবাদত সম্পাদন করার নাম ‘তাওহীদুল উলুহিয়্যাহ’। যেমন আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَمَآ اُمِرُوْٓا اِلَّا لِیَعْبُدُوا اللہَ مُخْلِصِیْنَ لَھُ الدِّیْنَﺃ حُنَفَا۬ئَ وَیُقِیْمُوا الصَّلٰوةَ وَیُؤْتُوا الزَّکٰوةَ وَذٰلِکَ دِیْنُ الْقَیِّمَةِﭔﺚ)</p><p>“তাদের শুধু এ নির্দেশই দেয়া হয়েছে যে, তারা খাঁটি মনে একনিষ্ঠভাবে একমাত্র আল্লাহর ইবাদত করবে, সালাত কায়েম করবে এবং যাকাত আদায় করবে। এটাই সঠিক ধর্ম।”(সূরা বাইয়িনাহ ৯৮:৫)  আল্লাহ তা‘আলা আরো বলেন:</p><p class='arabic uthmani'>(إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ)</p><p>“আমরা শুধু আপনারই ইবাদত করি এবং আপনারই নিকট সাহায্য প্রার্থনা করি।”</p><p class='arabic uthmani'>৩। تَوْحِيْدُ الْأَسْمَاءِ وَالصِّفَاتِ</p><p><b> তাওহীদুল আসমায়ি ওয়াস সিফাত (নাম ও গুণাবলীর ক্ষেত্রে আল্লাহর এককত্ব) : </b> পবিত্র কুরআন ও সহীহ হাদীসে আল্লাহ তা‘আলার যে সব সুন্দর নাম ও পবিত্র গুণাবলী বর্ণিত হয়েছে সেগুলোর কোন বিকৃতি, অস্বীকৃতি, অপব্যাখ্যা, সাদৃশ্য স্থাপন এবং ধরণ-গঠন জিজ্ঞাসা ছাড়াই একমাত্র আল্লাহ তা‘আলার জন্য সাব্যস্ত করা এবং এর প্রতি পূর্ণ ঈমান রাখার নাম “তাওহীদুল আসমায়ি ওয়াস সিফাত”। যেমন আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَلِلہِ الْاَسْمَا۬ئُ الْحُسْنٰی فَادْعُوْھُ بِھَا)</p><p>“আল্লাহ তা‘আলার রয়েছে সুন্দর নামসমূহ তোমরা তা দ্বারাই তাঁকে ডাক।”(সূরা আরাফ ৭:১৮০) তিনি আরো বলেন:</p><p class='arabic uthmani'>(اَلرَّحْمٰنُ عَلَی الْعَرْشِ اسْتَوٰی)</p><p>“দয়াময় আল্লাহ আরশের উপর সমুন্নত।” (সূরা ত্বহা ২০:৫), তিনি আরো বলেন:</p><p class='arabic uthmani'>(الرَّحْمٰنِ الرَّحِيْمِ)</p><p>“যিনি পরম করুণাময়, অতিশয় দয়ালু।”ইত্যাদি।</p><p><b> তাওহীদের প্রয়োজনীয়তা: </b> তাওহীদের প্রয়োজনীয়তা অপরিসীম যা বলার অপেক্ষা রাখেনা, সংক্ষিপ্ত পরিসরে কয়েকটি দিক আলোকপাতের মাধ্যমে তাওহীদের প্রয়োজনীয়তা আলোচনা করা হলঃ</p><p><b> ১। সর্বপ্রথম ওয়াজিব তাওহীদ: </b> তাওহীদ এমন একটি বিষয় যা ছাড়া কোন ব্যক্তির ঈমান সঠিক হতে পারেনা, বরং ঈমানের অপর নাম তাওহীদ। যাবতীয় ইবাদতের পূর্বে অবশ্যই তাওহীদ শিক্ষা ও পালন করা অপরিহার্য।</p><p>আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنْبِكَ)</p><p>“(সর্বপ্রথম) জ্ঞান অর্জন কর যে আল্লাহ ব্যতীত সত্যিকার কোন মা‘বূদ নেই। অতঃপর তোমার অপরাধের ক্ষমা প্রার্থনা কর।”(সূরা মুহাম্মদ ৪৭:১৯)</p><p>সুতরাং প্রথম ওয়াজিব হল তাওহীদ বা আল্লাহ তা‘আলার এককত্ব। নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন:</p><p class='arabic uthmani'>بُنِيَ الْاِسْلَامُ عَلٰي خَمْسٍ شَهَادَةُ اَنْ لَّا اِلٰهَ اِلَّا اللّٰهُ</p><p>ইসলামের ভিত্তি হল পাঁচটি স্তম্ভের উপর, তন্মধ্যে প্রথম হলো সাক্ষ্য প্রদান করা যে, আল্লাহ তা‘আলা ব্যতীত সত্যিকার কোন মা‘বূদ নেই। (সহীহুল বুখারী হা: ৮)</p><p>এরই নাম তাওহীদ। এ রুকন ছাড়া ইসলামে কোন ইবাদাতের মূল্য নেই অতএব প্রথম ওয়াজিব হল তাওহীদ বা আল্লাহ তা‘আলার এককত্ব মানা।</p><p><b> ২। বান্দার উপর আল্লাহ তা‘আলার হক তাওহীদ : </b> আল্লাহ তা‘আলা মানুষকে সৃষ্টি করেছেন কোন বিনিময় পাওয়ার জন্য নয়, আর মানুষও আল্লাহ তা‘আলাকে কোন বিনিময় দেয়ার ক্ষমতা রাখেনা। কিন্তু সৃষ্টি হিসাবে তার উপর স্রষ্টার হক রয়েছে। সহীহ বুখারীর হাদীসে এসেছে নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) মুয়াযকে (রাঃ) জিজ্ঞাসা করলেন, তুমি কি জানো বান্দার উপর আল্লাহ তা‘আলার হক কী? তিনি বললেনঃ  আল্লাহ তা‘আলা এবং তাঁর রাসূলই ভাল জানেন। তখন তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ</p><p class='arabic uthmani'>حَقُّ اللّٰهِ عَلَي الْعِبَادِ اَنْ يَّعْبُدُوْهُ وَلَايُشْرِكُوْبِهِ شَيْئًا</p><p>“বান্দার ওপর আল্লাহ তা‘আলার হক হল তারা একমাত্র তাঁর ইবাদত করবে এবং তাঁর সাথে কাউকে শরীক করবেনা।” অর্থাৎ তাঁর তাওহীদ পালন করাই হল বান্দার ওপর আল্লাহ তা‘আলার হক। (সহীহুল বুখারী হা: ১২৮)</p><p><b> ৩। নবুওয়াতের অধিকাংশ সময় তাওহীদের দাওয়াত প্রদানঃ </b> সর্বশ্রেষ্ঠ ও সর্বশেষ নাবী মুহাম্মদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নবুওয়াতের ২৩ বছরের মধ্যে ১৩টি বছরই শুধু তাওহীদ এর ভিত্তি মজবুত করার আপ্রাণ চেষ্টা চালিয়েছেন। সুতরাং তাওহীদের প্রয়োজনীয়তা বলার অপেক্ষা রাখেনা।</p><p><b> ৪। তাওহীদ ছাড়া জান্নাতে প্রবেশ সম্ভব নয়ঃ </b> মানুষ যতই ইবাদত করুক না কেন যদি তার তাওহীদ ঠিক না থাকে, তার মাঝে শির্ক স্থান পেয়ে যায় তাহলে নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন:</p><p class='arabic uthmani'>مَنْ لَقِيَ اللّٰهَ وَلَا يُشْرِكُ بِهِ شَيْئًا دَخَلَ الْجَنَّةَ وَمَنْ لَقِيَ اللّٰهَ وَيُشْرِكُ بِهِ شَيْئًا دَخَلَ النَّارَ</p><p>যে ব্যক্তি কোনরূপ শির্কে লিপ্ত না হয়ে তাওহীদের উপর মারা যায় সে জান্নাতে যাবে, অপরপক্ষে যে শির্কে লিপ্ত হয়ে মারা যায় সে  জাহান্নামে যাবে। (সহীহ মুসলিম হা: ৯৩)</p><p><b> ৫। তাওহীদের বদৌলতে জাহান্নাম হতে মুক্তিঃ </b> কিয়ামাতের ফায়সালার পর অপরাধী মু’মিন ব্যক্তি শাস্তি ভোগের জন্য জাহান্নামে যাবে। অতঃপর শাস্তি শেষে তাদের তাওহীদের বদৌলতে জাহান্নাম হতে আল্লাহ তা‘আলা মুক্তি দেবেন। নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন: আল্লাহ তা‘আলা বলবেনঃ</p><p class='arabic uthmani'>وَعِزَّتِيْ وَجَلَالِيْ لِأَخْرُجَنَّ مِنَ النَّارِ مَنْ قَالَ : لَا اِلٰهَ اِلَّا اللّٰهُ</p><p>আমার ইয্যাত ও সম্মানের কসম করে বলছি! যারা লা ইলাহা ইল্লাল্লাহু বলার মাধ্যমে শির্ক মুক্ত হয়ে তাওহীদের উপর রয়েছে আমি অবশ্যই তাদেরকে জাহান্নাম হতে বের করব। (সহীহ বুখারী হা: ৪৪, সহীহ মুসলিম হা: ৩২৬)</p><p>অতএব তাওহীদ ছাড়া ইসলাম গ্রহণ হতে পারে না, আর ইসলাম গ্রহণ ছাড়া জান্নাত পাওয়া যাবেনা। সুতরাং তাওহীদের প্রয়োজনীয়তা আর বলার আপেক্ষা রাখে না। আল্লাহ তা‘আলা আমাদেরকে তাওহীদ জানা এবং মানার তাওফীক দান করুন। আমীন!</p>"},{"id":67136,"resource_id":165,"text":"<p>সমস্ত প্রশংসা[১] সারা জাহানের প্রতিপালক আল্লাহর জন্য।[২]</p><p><b>[১]</b> الحَمد এর মধ্যে যে ال রয়েছে, তা استغراق (সমূদয়) অথবা اختصاص (নির্দিষ্টীকরণ)এর অর্থে ব্যবহার হয়েছে। অর্থাৎ, সমস্ত প্রশংসা আল্লাহর জন্যই বা তাঁর জন্য নির্দিষ্ট; কেননা প্রশংসার প্রকৃত অধিকারী একমাত্র মহান আল্লাহই। কারো মধ্যে যদি কোন গুণ, সৌন্দর্য এবং কৃতিত্ব থাকে, তবে তাও মহান আল্লাহ কর্তৃক সৃষ্ট। অতএব প্রশংসার অধিকারী তিনিই। 'আল্লাহ' শব্দটি মহান আল্লাহর সত্তার এমন এক সতন্ত্র নাম যার ব্যবহার অন্য কারো জন্য করা বৈধ নয়। 'আলহামদু লিল্লাহ' কৃতজ্ঞতা-জ্ঞাপক বাক্য। এর বহু ফযীলতের কথা হাদীসসমূহে এসেছে। একটি হাদীসে 'লা-ইলাহা ইল্লাল্লা-হ'কে উত্তম জিকির বলা হয়েছে এবং 'আলহামদু লিল্লাহ'কে উত্তম দুআ বলা হয়েছে। <em>(তিরমিযী, নাসায়ী ইত্যাদি)</em> সহীহ মুসলিম এবং নাসায়ীর বর্ণনায় এসেছে, 'আলহামদু লিল্লাহ' দাঁড়িপাল্লা ভর্তি করে দেয়। এ জন্যই অন্য এক বর্ণনায় এসেছে যে, আল্লাহ এটা পছন্দ করেন যে, প্রত্যেক পানাহারের পর বান্দা তাঁর প্রশংসা করুক। <em>(সহীহ মুসলিম)</em></p><p><b>[২]</b> رَبّ মহান আল্লাহর সুন্দর নামসমূহের অন্যতম। যার অর্থ হল, প্রত্যেক জিনিসকে সৃষ্টি ক'রে তার প্রয়োজনীয় জিনিসের ব্যবস্থা ক'রে তাকে পরিপূর্ণতা দানকারী। কোন জিনিসের প্রতি সম্বন্ধ (ইযাফত) না করে এর ব্যবহার অন্য কারো জন্য বৈধ নয়। عَالَمِيْن عَالَم (বিশ্ব-জাহান) শব্দের বহুবচন। তবে সকল সৃষ্টির সমষ্টিকে عَالَم বলা হয়। এই জন্যেই এর বহুবচন ব্যবহার হয় না। কিন্তু এখানে তাঁর (আল্লাহর) পূর্ণ প্রতিপালকত্ব প্রকাশের জন্য এরও বহুবচন ব্যবহার করা হয়েছে। এ থেকে উদ্দেশ্য হল, সৃষ্টির ভিন্ন ভিন্ন শ্রেণী বা সম্প্রদায়। যেমন, জ্বিন সম্প্রদায়, মানব সম্প্রদায়, ফিরিশ্তাকুল এবং জীব-জন্তু ও পশু-পক্ষীকুল ইত্যাদি। এই সমস্ত সৃষ্টির প্রয়োজনসমূহও একে অপর থেকে অবশ্যই ভিন্নতর। কিন্তু বিশ্ব-প্রতিপালক প্রত্যেকের অবস্থা, পরিস্থিতি এবং প্রকৃতি ও দেহ অনুযায়ী তার প্রয়োজনীয় জিনিসের ব্যবস্থা করে থাকেন।</p>"}]},{"id":3,"verse_number":3,"verse_key":"1:3","hizb_number":1,"rub_el_hizb_number":1,"ruku_number":1,"manzil_number":1,"sajdah_number":null,"text_uthmani":"ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ","page_number":1,"juz_number":1,"words":[{"id":2953,"position":1,"audio_url":"wbw/001_003_001.mp3","char_type_name":"word","text_uthmani":"ٱلرَّحْمَـٰنِ","page_number":1,"line_number":4,"text":"ٱلرَّحْمَـٰنِ","translation":{"text":"The Most Gracious","language_name":"english"},"transliteration":{"text":"al-raḥmāni","language_name":"english"}},{"id":2954,"position":2,"audio_url":"wbw/001_003_002.mp3","char_type_name":"word","text_uthmani":"ٱلرَّحِيمِ","page_number":1,"line_number":4,"text":"ٱلرَّحِيمِ","translation":{"text":"the Most Merciful","language_name":"english"},"transliteration":{"text":"l-raḥīmi","language_name":"english"}},{"id":2955,"position":3,"audio_url":null,"char_type_name":"end","text_uthmani":"٣","page_number":1,"line_number":4,"text":"٣","translation":{"text":"(3)","language_name":"english"},"transliteration":{"text":null,"language_name":"english"}}],"audio":{"url":"AbdulBaset/Mujawwad/mp3/001003.mp3","segments":[[0,1,1380,4340],[1,2,4350,8350]]},"translations":[{"id":1065244,"resource_id":106,"text":"Ша сов къинхетаме‚ къинхетаме волчу,"},{"id":325649,"resource_id":56,"text":"至仁至慈的主，"}],"tafsirs":[{"id":67137,"resource_id":165,"text":"<p>যিনি অনন্ত করুণাময়, পরম দয়ালু।</p><p>رَحما শব্দটি فَعلان এর ওজনে। আর رَحِيم শব্দটি فَعِيل এর ওজনে। দু'টোই মুবালাগার স্বীগা (অতিরিক্ততাবোধক বাচ্য)। যার মধ্যে আধিক্য ও স্থায়িত্বের অর্থ পাওয়া যায়। অর্থাৎ, মহান আল্লাহ অতীব দয়াময় এবং তাঁর এ গুণ অন্যান্য গুণসমূহের মত চিরন্তন। কোন কোন আলেমগণ বলেছেন 'রাহীম'-এর তুলনায় 'রাহমান'-এর মধ্যে মুবালাগা (অতিরিক্ততাঃ রহমত বা দয়ার ভাগ) বেশী আছে। আর এই জন্যই বলা হয়, 'রাহমানাদ্দুনিয়া অল-আখিরাহ' (দুনিয়া ও আখেরাতে রহমকারী)। দুনিয়াতে তাঁর রহমত ব্যাপক; বিনা পার্থক্যে কাফের ও মু'মিন সকলেই তা দ্বারা উপকৃত হচ্ছে। তবে আখেরাতে তিনি কেবল 'রাহীম' হবেন। অর্থাৎ, তাঁর রহমত কেবল মু'মিনদের জন্য নির্দিষ্ট হবে। اللَّهُمَّ! اجْعَلْنَا مِنْهُمْ (আল্লাহ আমাদেরকে তাঁদেরই অন্তর্ভুক্ত কর!) (আ-মীন)</p>"},{"id":171861,"resource_id":381,"text":"<p><b> ৩ নং আয়াতের তাফসীর: </b></p><p>“আর রহমান ও আর রহীম” এ দু’টি আল্লাহ তা‘আলার সুউচ্চ গুণাবলী এবং সুন্দর সুন্দর নামসমূহের মধ্যে অন্যতম। الرَّحْمٰنِ (আর রহমান) ও الرَّحِیْمِ (আর রহীম) উভয়টি رَحْمَةٌ (রহমাতুন) শব্দ থেকে গৃহীত। আবার কেউ বলেছেন, এগুলো কোন শব্দ থেকে গৃহীত নয়।</p><p>الرَّحْمٰنِ (আর রহমান) নামটি الرَّحِیْمِ (আর রহীম) থেকে ব্যাপক ও বিস্তৃত। আল্লাহ তা‘আলা মু’মিন ও কাফিরসহ দুনিয়ার সকল মাখলুকের জন্য রহমান বা দয়াময়, আর রহীম বা দয়ালু পরকালে শুধু মু’মিনদের জন্য। (আযওয়াউল বায়ান, অত্র আয়াতের তাফসীর)</p><p>প্রসিদ্ধ তাবিঈ আবদুল্লাহ বিন মুবারক (রহঃ) বলেন: الرَّحْمٰنِ (আর রহমান) নামে যখন চাওয়া হয় তখন প্রদান করা হয়। আর الرَّحِیْمِ (আর রহীম) নামে যখন চাওয়া হয় না তখন তিনি রাগ করেন। এ অর্থেই রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর বাণী:</p><p class='arabic uthmani'>مَنْ لَمْ يَسْأَلِ اللّٰهَ يَغْضَبْ عَلَيْهِ)</p><p>যে ব্যক্তি আল্লাহ তা‘আলার কাছে চায় না, তিনি তার প্রতি রাগ করেন। (তিরমিযী হা: ৩৩৭৩, সহীহ; ইবনে কাসীর)</p><p>ইবনে জারীর আত-তাবারী (রহঃ) তাঁর স্বীয় তাফসীর গ্রন্থে উল্লেখ করেছেন .......আল আরযামী (রহঃ) বলেন: (الرَّحْمٰنِ الرَّحِيْمِ) দয়াময় ও দয়ালু, الرَّحْمٰنِ (আর রহমান) বা দয়াময় সকল সৃষ্টি জীবের জন্য, আর الرَّحِيْمِ (আর রহীম) বা দয়ালু শুধু মু’মিনদের জন্য। (তাফসীর তাবারী, ১/১১৭) এ জন্য আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(ثُمَّ اسْتَوٰي عَلَي الْعَرْشِ الرَّحْمٰنِ)</p><p>“অতঃপর আরশের ওপর সমুন্নত হলেন দয়াময় আল্লাহ।” (সূরা ফুরকান ২৫:৫৯)</p><p>আল্লাহ তা‘আলা আরো বলেন:</p><p class='arabic uthmani'>(اَلرَّحْمٰنُ عَلَي الْعَرْشِ اسْتَوٰي)</p><p>“দয়াময় আল্লাহ আরশের ওপর সমুন্নত।”(সূরা ত্বহা ২০:৫) এখানে আল্লাহ তা‘আলা তার রহমান নাম দ্বারা আরশের ওপর সমুন্নত হবার কথা উল্লেখ করেছেন যাতে সকল মাখলুককে তার রহমতে শামিল করে নেন।</p><p>অপরপক্ষে আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَكَانَ بِالْمُؤْمِنِيْنَ رَحِيْمًا)</p><p>“তিনি মু’মিনদের প্রতি অত্যন্ত দয়ালু।”(সূরা আহযাব ৩৩:৪৩) এখানে তাঁর রহীম নাম শুধু মু’মিনদের সাথে সীমাবদ্ধ করে দিয়েছেন।</p><p>মুফাসসিরগণ বলেন: এ আয়াতদ্বয় প্রমাণ করে যে, রহমান গুণটি রহীম থেকে ব্যাপক যা উভয়কালের সকল মাখলুকের জন্য প্রযোজ্য। আর রহীম শুধু মু’মিনদের জন্য সীমাবদ্ধ। (ইবনু কাসীর, ১/৭৬, অত্র আয়াতের তাফসীর)</p><p>الرَّحْمٰنُ (আর রহমান) নামটি আল্লাহ তা‘আলার সাথে খাস। এ নামে অন্য কাউকে নামকরণ করা বৈধ নয়। যেমন আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(قُلِ ادْعُوا اللّٰهَ أَوِ ادْعُوا الرَّحْمٰنَ أَيًّا مَّا تَدْعُوا فَلَهُ الْأَسْمَا۬ءُ الْحُسْنٰي)</p><p>“বল:‎ ‘তোমরা ‘আল্লাহ’নামে আহ্বান কর‎ বা ‘রহমান’নামে আহ্বান কর‎, তোমরা যে নামেই আহ্বান কর‎ সকল সুন্দর নামই তো তাঁর।”(সূরা ইসরা ১৭:১১০)</p>"}]},{"id":4,"verse_number":4,"verse_key":"1:4","hizb_number":1,"rub_el_hizb_number":1,"ruku_number":1,"manzil_number":1,"sajdah_number":null,"text_uthmani":"مَـٰلِكِ يَوْمِ ٱلدِّينِ","page_number":1,"juz_number":1,"words":[{"id":3252,"position":1,"audio_url":"wbw/001_004_001.mp3","char_type_name":"word","text_uthmani":"مَـٰلِكِ","page_number":1,"line_number":4,"text":"مَـٰلِكِ","translation":{"text":"(The) Master","language_name":"english"},"transliteration":{"text":"māliki","language_name":"english"}},{"id":3253,"position":2,"audio_url":"wbw/001_004_002.mp3","char_type_name":"word","text_uthmani":"يَوْمِ","page_number":1,"line_number":4,"text":"يَوْمِ","translation":{"text":"(of the) Day","language_name":"english"},"transliteration":{"text":"yawmi","language_name":"english"}},{"id":3254,"position":3,"audio_url":"wbw/001_004_003.mp3","char_type_name":"word","text_uthmani":"ٱلدِّينِ","page_number":1,"line_number":4,"text":"ٱلدِّينِ","translation":{"text":"(of the) Judgment","language_name":"english"},"transliteration":{"text":"l-dīni","language_name":"english"}},{"id":3255,"position":4,"audio_url":null,"char_type_name":"end","text_uthmani":"٤","page_number":1,"line_number":4,"text":"٤","translation":{"text":"(4)","language_name":"english"},"transliteration":{"text":null,"language_name":"english"}}],"audio":{"url":"AbdulBaset/Mujawwad/mp3/001004.mp3","segments":[[0,1,5650,7250]]},"translations":[{"id":1065245,"resource_id":106,"text":"Шен долахь бекхаман де<sup foot_note=111787>1</sup>долчу."},{"id":326601,"resource_id":56,"text":"报应日的主，"}],"tafsirs":[{"id":171862,"resource_id":381,"text":"<p><b> ৪ নং আয়াতের তাফসীর:  </b></p><p>مالك এর অর্থ কোন বস্তুর ওপর এমন অধিকার থাকা যার ব্যবহার, পরিবর্তন-পরিবর্ধন ও হস্তান্তরসহ সকল প্রকার একচ্ছত্র ক্ষমতা রাখে। যেমন পরকালে আল্লাহ তা‘আলা তাঁর বান্দাদেরকে জান্নাতে ও জাহান্নামে দেবেন এ ব্যাপারে তিনি ব্যতীত আর কোন মালিক নেই। তিনি দয়ালু হয়ে জাহান্নামের শাস্তিকে কারো জন্য কম করে দেবেন, আবার প্রাপ্য হিসেবে কারো জন্য বৃদ্ধি করে দেবেন, এ ব্যাপারে আল্লাহ তা‘আলা ব্যতীত অন্য কোন মালিক নেই। সকল কিছুর মালিক একমাত্র আল্লাহ তা‘আলা। যেমন আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(لِلّٰهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ)</p><p>“আল্লাহরই জন্য নভোমণ্ডল ও ভূমণ্ডলের আধিপত্য।”(সূরা শুরা ৪২:৪৯)</p><p>আল্লাহ তা‘আলা আরো বলেন:</p><p class='arabic uthmani'>(لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ يُحْيِيْ وَيُمِيْتُ وَهُوَ عَلٰي كُلِّ شَيْءٍ قَدِيْرٌ)</p><p>“আকাশমন্ডলী ও পৃথিবীর কর্তৃত্ব একমাত্র তাঁরই; তিনি জীবন দান করেন ও মৃত্যু ঘটান; তিনি সর্ববিষয়ে সর্বশক্তিমান।”(সূরা হাদীদ ৫৭:২)</p><p>অতএব আকাশ ও পৃথিবীর একমাত্র অধিপতি আল্লাহ তা‘আলা। শুধু তাই নয়, এতদুভয়ের মধ্যে যা কিছু আছে সব কিছুর মালিকও তিনি। আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَلِلّٰهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا يَخْلُقُ مَا يَشَا۬ءُ)</p><p>“আসমান ও জমিনের এবং এদের মধ্যে যা কিছু আছে তার সার্বভৌমত্ব আল্লাহরই। তিনি যা ইচ্ছা সৃষ্টি করেন।”(সূরা মায়িদাহ ৫:১৭)</p><p>অনুরূপভাবে তিনি আরো বলেন:</p><p class='arabic uthmani'>(وَلِلّٰهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَإِلَيْهِ الْمَصِيرُ)</p><p>“আসমান ও জমিনের এবং এদের মধ্যে যা কিছু আছে তার সার্বভৌমত্ব আল্লাহরই, আর প্রত্যাবর্তন তাঁরই দিকে।”(সূরা মায়িদাহ ৫:১৮) অতএব যিনি আসমান ও জমিন এবং উভয়ের মাঝে সবকিছুর, মালিক তিনি আমাদের জীবন-মরণেরও মালিক। সুতরাং তাঁর পৃথিবীতে তাঁরই দেয়া জীবন বিধানের আলোকে আমাদের চলা উচিত।</p><p>(يَوْمِ الدِّيْنِ) “প্রতিফল দিবস” বলতে কিয়ামতের দিনকে বুঝানো হয়েছে, সেদিন আল্লাহ তা‘আলা ভাল-মন্দ সকল কাজ-কর্মের প্রতিদান দেবেন এবং সেদিন আল্লাহ তা‘আলা ব্যতীত আর কোন রাজাধিরাজ থাকবে না। আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَمَآ اَدْرٰٿکَ مَا یَوْمُ الدِّیْنِﭠﺫ ثُمَّ مَآ اَدْرٰٿکَ مَا یَوْمُ الدِّیْنِﭡﺚ یَوْمَ لَا تَمْلِکُ نَفْسٌ لِّنَفْسٍ شَیْئًاﺚ وَالْاَمْرُ یَوْمَئِذٍ لِّلّٰهِ)</p><p>“প্রতিদান দিবস কী? তা কি তুমি জানো? অতঃপর বলিঃ প্রতিদান দিবস কী তা কি তুমি অবগত আছ? সেদিন কোন মানুষ অপরের জন্য কিছু করার সামর্থ রাখবে না, সেদিন সকল কর্তৃত্ব একমাত্র আল্লাহরই।”(সূরা ইনফিতার ৮২:১৭-১৯)</p><p>সেদিন কোন ফেরেশতা, মানুষ, জিন কেউ কোন কিছু করতে পারবে না এবং তারা সেখানে কোন কথাও বলতে পারবে না, একমাত্র আল্লাহ তা‘আলা যাকে অনুমতি দেবেন তিনি ব্যতীত।</p><p>আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(یَوْمَ یَقُوْمُ الرُّوْحُ وَالْمَلٰ۬ئِکَةُ صَفًّاﺞ لَّا یَتَکَلَّمُوْنَ اِلَّا مَنْ اَذِنَ لَھُ الرَّحْمٰنُ وَقَالَ صَوَابًا)</p><p>“সেদিন রূহ ও ফেরেশতারা সারিবদ্ধভাবে দাঁড়াবে। দয়াময় আল্লাহ যাকে অনুমতি দেবেন, সে ব্যতীত অন্য কেউ কথা বলতে পারবে না এবং সে সঠিক কথা বলবে।”(সূরা নাবা ৭৮:৩৮)</p><p>সেদিন আল্লাহ তা‘আলা প্রত্যেক ব্যক্তিকে পরিপূর্ণ প্রতিদান দেবেন। কাউকে কমও দেবেন না এবং কাউকে বেশিও দেবেন না। কারো প্রতি কোন অবিচার করা হবে না। ইনসাফের সাথে সকলে ভাল মন্দ কর্মের ন্যায্য প্রতিদান ও প্রতিফল পাবে।</p><p>আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(يَوْمَئِذٍ يُّوَفِّيهِمُ اللّٰهُ دِينَهُمُ الْحَقَّ)</p><p>“সেদিন আল্লাহ তাদের প্রাপ্য প্রতিফল পুরোপুরি দেবেন।”(সূরা নূর ২৪:২৫)</p><p>তাই প্রতিটি মানুষের মনে রাখা উচিত যে, আমরা ভাল-মন্দ যা কিছু করব প্রতিটিরই ফলাফল ভোগ করতে হবে। অতএব আমাদের মন্দ কর্ম পরিহার করে ভাল কর্মে অগ্রগামী হওয়া উচিত।</p>"},{"id":67138,"resource_id":165,"text":"<p>(যিনি) বিচার দিনের মালিক।[১][১] যদিও দুনিয়াতে কর্মের প্রতিদান দেওয়ার নীতি কোন না কোনভাবে চালু আছে, তবুও এর পূর্ণ বিকাশ ঘটবে আখেরাতে। আল্লাহ তাআলা প্রত্যেককে তার ভাল ও মন্দ কর্ম অনুযায়ী পরিপূর্ণ প্রতিদান শান্তি ও শাস্তি প্রদান করবেন। অনুরূপ দুনিয়াতে অনেক মানুষ ক্ষণস্থায়ীভাবে কারণ-ঘটিত ক্ষমতা ও শক্তির মালিক হয়। কিন্তু আখেরাতে সমস্ত এখতিয়ার ও ক্ষমতার মালিক হবেন একমাত্র মহান আল্লাহ। সেদিন তিনি বলবেন, \"আজ রাজত্ব কার?\" অতঃপর তিনিই উত্তর দিয়ে বলবেন, \"পরাক্রমশালী একক আল্লাহর জন্য।\"{يَوْمَ لَا تَمْلِكُ نَفْسٌ لِنَفْسٍ شَيْئًا وَالأَمْرُ يَوْمَئِذٍ للهِ}(সূরা ইনফিতার ৮২:১৯)(যেদিন কেউ কারও কোন উপকার করতে পারবে না এবং সেদিন সকল কর্তৃত্ব হবে আল্লাহর।) এটা হবে বিচার ও প্রতিদান দিবস।</p>"}]},{"id":5,"verse_number":5,"verse_key":"1:5","hizb_number":1,"rub_el_hizb_number":1,"ruku_number":1,"manzil_number":1,"sajdah_number":null,"text_uthmani":"إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ","page_number":1,"juz_number":1,"words":[{"id":5334,"position":1,"audio_url":"wbw/001_005_001.mp3","char_type_name":"word","text_uthmani":"إِيَّاكَ","page_number":1,"line_number":5,"text":"إِيَّاكَ","translation":{"text":"You Alone","language_name":"english"},"transliteration":{"text":"iyyāka","language_name":"english"}},{"id":5335,"position":2,"audio_url":"wbw/001_005_002.mp3","char_type_name":"word","text_uthmani":"نَعْبُدُ","page_number":1,"line_number":5,"text":"نَعْبُدُ","translation":{"text":"we worship","language_name":"english"},"transliteration":{"text":"naʿbudu","language_name":"english"}},{"id":5336,"position":3,"audio_url":"wbw/001_005_003.mp3","char_type_name":"word","text_uthmani":"وَإِيَّاكَ","page_number":1,"line_number":5,"text":"وَإِيَّاكَ","translation":{"text":"and You Alone","language_name":"english"},"transliteration":{"text":"wa-iyyāka","language_name":"english"}},{"id":5337,"position":4,"audio_url":"wbw/001_005_004.mp3","char_type_name":"word","text_uthmani":"نَسْتَعِينُ","page_number":1,"line_number":5,"text":"نَسْتَعِينُ","translation":{"text":"we ask for help","language_name":"english"},"transliteration":{"text":"nastaʿīnu","language_name":"english"}},{"id":5338,"position":5,"audio_url":null,"char_type_name":"end","text_uthmani":"٥","page_number":1,"line_number":5,"text":"٥","translation":{"text":"(5)","language_name":"english"},"transliteration":{"text":null,"language_name":"english"}}],"audio":{"url":"AbdulBaset/Mujawwad/mp3/001005.mp3","segments":[[0,1,1700,2810],[1,2,2820,4270],[2,3,4280,6560],[3,4,6570,11410]]},"translations":[{"id":1065246,"resource_id":106,"text":"Хьуна Iибадат до оха‚ Хьоьга гIо а доьху<sup foot_note=111788>1</sup>."},{"id":325730,"resource_id":56,"text":"我们只崇拜你，只求你祐助"}],"tafsirs":[{"id":67139,"resource_id":165,"text":"<p>আমরা কেবল তোমারই ইবাদত করি এবং তোমারই কাছে সাহায্য চাই।</p><p>ইবাদতের অর্থ হল, কারো সন্তুষ্টি লাভের জন্য অত্যধিক কাকুতি-মিনতি এবং পূর্ণ নম্রতা প্রকাশ করা। আর ইবনে কাসীর (রঃ) এর উক্তি অনুযায়ী 'শরীয়তে পূর্ণ ভালবাসা, বিনয় এবং ভয়-ভীতির সমষ্টির নাম হল ইবাদত।' অর্থাৎ, যে সত্তার সাথে ভালবাসা থাকবে তাঁর অতিপ্রাকৃত মহাক্ষমতার কাছে অসামর্থ্য ও অক্ষমতার প্রকাশও হবে এবং প্রাকৃত ও অতিপ্রাকৃত শক্তি দ্বারা তাঁর পাকড়াও ও শাস্তির ভয়ও থাকবে। এই আয়াতে সরল বাক্য হল, [نَعْبُدُكَ وَنَسْتَعِيْنُكَ] (আমরা তোমার ইবাদত করি এবং তোমার কাছে সাহায্য চাই।) কিন্তু মহান আল্লাহ এখানে مفعول (কর্মপদকে) فعل (ক্রিয়াপদ)-এর আগে এনে [إيَاكَ نَعْبُدَ وَإيَاكَ نَسْتَعِيْنُ] বলেছেন। আর এর উদ্দেশ্য বিশেষত্ব সৃষ্টি করা। (যেহেতু আরবী ব্যকরণে যে পদ সাধারণতঃ পরে ব্যবহার হয় তা পূর্বে প্রয়োগ করা হলে বিশেষত্বের অর্থ দিয়ে থাকে।) সুতরাং এর অর্থ হবে, 'আমরা কেবল তোমারই ইবাদত করি এবং কেবল তোমারই কাছে সাহায্য চাই।' এখানে স্পষ্ট যে, ইবাদত আল্লাহ ছাড়া অন্য কারো জন্য জায়েয নয়, যেমন সাহায্য কামনা করাও তিনি ছাড়া অন্য কারো কাছে বৈধ নয়। এই বাক্য দ্বারা শির্কের পথ বন্ধ করা হয়েছে। কিন্তু যাদের অন্তরে শির্কের ব্যাধি সংক্রমণ করেছে, তারা লৌকিক সাহায্য প্রার্থনা ও অলৌকিক সাহায্য প্রার্থনার মধ্যে পার্থক্যকে দৃষ্টিচ্যুত ক'রে সাধারণ মানুষদেরকে বিভ্রান্তিতে ফেলেছে। তারা বলে, দেখুন! যখন আমরা অসুস্থ হই, তখন সুস্থতার জন্য ডাক্তারের নিকট সাহায্য চাই। অনুরূপ বহু কাজে স্ত্রী, চাকর, ড্রাইভার এবং অন্যান্য মানুষের কাছেও সাহায্য কামনা করি। এইভাবে তারা বুঝাতে চায় যে, আল্লাহ ব্যতীত অন্যের কাছেও সাহায্য কামনা করা জায়েয। অথচ প্রাকৃত বা লৌকিক সাহায্য একে অপরের নিকট চাওয়া ও করা সবই বৈধ; এটা শির্ক নয়। এটা তো মহান আল্লাহ কর্তৃক নির্ধারিত এমন এক নিয়ম-নীতি, যাতে সমস্ত লৌকিক কার্য-কলাপ বাহ্যিক হেতুর ভিত্তিতেই হয়ে থাকে। এমন কি নবীরাও (সাধারণ) মানুষের কাছে সাহায্য চেয়েছেন। ঈসা (আঃ) বলেছিলেন, [<b> مَنْ أَنْصَارِي إِلَى اللهِ</b>] অর্থাৎ, কারা আছে যারা আল্লাহর পথে আমাকে সাহায্য করবে? <em>(সূরা আলে ইমরান ৩:৫২ আয়াত)</em> আর আল্লাহ তা'য়ালা মু'মিনদেরকে বলেন, <b>[وَتَعَاوَنُوا عَلَى البِرِّ وَالتَّقْوَى]</b> অর্থাৎ, তোমরা নেকী এবং আল্লাহভীতির কাজে একে অন্যের সাহায্য কর। <em>(সূরা মাইদাহ ৫:২ আয়াত)</em> বুঝা গেল যে, এ রকম সাহায্য (চাওয়া ও করা) নিষেধও নয় এবং শির্কও নয়। বরং তা বাঞ্ছনীয় ও প্রশংনীয় কাজ। পারিভাষিক শির্কের সাথে এর কি সম্পর্ক? শির্ক তো এই যে, এমন মানুষের কাছে সাহায্য কামনা করা যে বাহ্যিক হেতুর ভিত্তিতে কোন সাহায্য করতে পারবে না। যেমন, কোন মৃত ব্যক্তিকে সাহায্যের জন্য ডাকাডাকি করা, তাকে বিপদ থেকে মুক্তিদাতা এবং প্রয়োজন পূরণকারী মনে করা, তাকে ভাল-মন্দের মালিক ভাবা এবং বিশ্বাস করা যে, সে দূর এবং নিকট থেকে সকলের ফরিয়াদ শোনার ক্ষমতা রাখে। এর নাম হল, অলৌকিক পন্থায় সাহায্য চাওয়া এবং তাকে আল্লাহর গুণে গুণান্বিত করা। আর এরই নাম হল সেই শির্ক, যা দুর্ভাগ্যক্রমে অলী-আওলিয়াদের মহববতের নামে মুসলিম দেশগুলোতে ব্যাপকভাবে প্রচলিত রয়েছে। أعاذنا الله منه<b>তাওহীদ তিন প্রকারের।</b> এখানে মহান আল্লাহ আমাদেরকে তাঁর তাওহীদের প্রতি ইঙ্গিত করেছেন। তাই তাওহীদের গুরুত্বপূর্ণ তিনটি প্রকারের কথা উল্লেখ করে দেওয়া সঙ্গত মনে হয়। এই প্রকারগুলো হলঃ তাওহীদুর রুবূবিয়্যাহ (প্রতিপালকত্বের একত্ববাদ), তাওহীদুল উলূহিয়্যাহ (উপাস্যত্বের একত্ববাদ) এবং তাওহীদুল আসমা অসসিফাত (নাম ও গুণাবলীর একত্ববাদ)।<b>১।</b> <b>তাওহীদুর রুবূবিয়্যাহর অর্থ হল,</b> এই বিশ্বজাহানের স্রষ্টা, মালিক, রুযীদাতা, নিয়ন্তা ও পরিচালক একমাত্র আল্লাহ তাআলা। নাস্তিক ও জড়বাদীরা ব্যতীত সকল মানুষই এই তাওহীদকে স্বীকার করে। এমনকি মুশরিক (অংশীবাদী)রাও এটা বিশ্বাস করতো এবং আজও করে। যেমন ক্বুরআন কারীমে মুশরিকদের এ তাওহীদকে স্বীকার করার কথা উল্লেখ করা হয়েছে। আল্লাহ বলেছেন, \"তুমি জিজ্ঞেস কর, কে রুযী দান করে তোমাদেরকে আসমান থেকে ও যমীন থেকে, কিংবা কে তোমাদের কান ও চোখের মালিক? কে জীবিতকে মৃতের ভিতর থেকে বের করেন এবং কেই বা মৃতকে জীবিতের মধ্য থেকে বের করেন? কে করেন কর্ম সম্পাদনের ব্যবস্থাপনা? তারা বলবে, আল্লাহ।\" (অর্থাৎ, সমস্ত কর্ম সম্পাদনকারী হলেন আল্লাহ।) <em>(সূরা ইউনুস  ১০:৩১)</em> অন্যত্র বলেছেন, \"যদি তুমি তাদেরকে জিজ্ঞেস কর, আসমান ও যমীন কে সৃষ্টি করেছে? তাহলে তারা অবশ্যই বলবে, আল্লাহ।\" <em>(সূরা যুমার ৩৯:৩৮)</em> তিনি আরো বলেছেন, \"জিজ্ঞেস কর, এই পৃথিবী এবং এতে যা আছে তা কার, যদি তোমরা জানো ? তারা ত্বরিৎ বলবে, আল্লাহর; বল, তবুও কি তোমরা শিক্ষা গ্রহণ করবে না ? জিজ্ঞেস কর, কে সপ্তাকাশ ও মহা আরশের অধিপতি ? তারা বলবে, আল্লাহ। বল, তবুও কি তোমরা সাবধান হবে না । জিজ্ঞেস কর, সব কিছুর কর্তৃত্ব কার হাতে; যিনি আশ্রয় দান করেন এবং যাঁর উপর আশ্রয়দাতা নেই, যদি তোমরা জানো ? তারা বলবে, আল্লাহর। <em>(সূরা মু'মিনুন ২৩:৮৪-৮৯)</em> এ ছাড়াও আরো অনেক আয়াত আছে।<b>২। তাওহীদুল উলূহিয়্যাহর অর্থ হল,</b> সর্ব প্রকার ইবাদতের যোগ্য একমাত্র আল্লাহকে মনে করা। আর ইবাদত সেই সব কাজকে বলা হয়, যা কোন নির্দিষ্ট সত্তার সন্তুষ্টি লাভের আশায় অথবা তাঁর অসন্তুষ্টির ভয়ে করা হয়। (অন্য কথায়ঃ ইবাদত প্রত্যেক সেই গুপ্ত বা প্রকাশ্য কথা বা কাজের নাম, যা আল্লাহ পছন্দ করেন ও যাতে তিনি সন্তুষ্ট হন।) সুতরাং কেবল নামায, যাকাত, রোযা, হজ্জই ইবাদত নয়, বরং কোন সত্তার নিকট দুআ ও আবেদন করা তার নামে মানত করা, তার সামনে হাত বেঁধে দাঁড়িয়ে থাকা, তার তাওয়াফ করা এবং তার কাছে আশা রাখা ও তাকে ভয় করা ইত্যাদিও ইবাদত। তাওহীদে উলূহিয়্যাহ হল (উল্লিখিত) সমস্ত কাজ কেবল মহান আল্লাহর জন্য সম্পাদিত হওয়া। কবরপূজার ব্যাধিতে আক্রান্ত আম-খাস বহু মানুষ তাওহীদে উলূহিয়্যাতে শির্ক করছে। উল্লিখিত ইবাদতসমূহের অনেক প্রকারই তারা কবরে সমাধিস্থ ব্যক্তিদের এবং মৃত বুযুর্গদের জন্য ক'রে থাকে যা সুস্পষ্ট শির্ক।<b>৩। তাওহীদুল আসমা অসসিফাত হল</b>, মহান আল্লাহর যে গুণাবলী ক্বুরআন ও হাদীসে বর্ণিত হয়েছে, সেগুলিকে কোন রকমের অপব্যাখ্যা এবং বিকৃত করা ছাড়াই বিশ্বাস করা। আর এই গুণাবলীর অনুরূপ অধিকারী (আল্লাহ ছাড়া) অন্য কাউকে মনে না করা। যেমন, অদৃশ্য জগতের জ্ঞান (গায়বী খবর) রাখা তাঁর গুণ, দূর ও নিকট থেকে সকলের ফরিয়াদ শোনার শক্তি তিনি রাখেন, বিশ্বজাহানের নিয়ন্ত্রণ ও ব্যবস্থাপনার সব রকমের এখতিয়ার তাঁরই; এই ধরনের আরো যত ইলাহী গুণাবলী আছে আল্লাহ ব্যতীত কোন নবী, ওলী এবং অন্য কাউকেও এই গুণের অধিকারী মনে না করা। করলে তা শির্ক হয়ে যাবে। বড় দুঃখের বিষয় যে, কবরপূজারীদের মধ্যে এই প্রকারের শির্ক ব্যাপক। তারা আল্লাহর উল্লিখিত গুণে অনেক বুযুর্গদেরকে অংশীদার বানিয়ে রেখেছে। أَعَاذَنَا اللهُ مِنْهُ</p>"},{"id":171863,"resource_id":381,"text":"<p><b> ৫ নং আয়াতের তাফসীর: </b></p><p>অত্র আয়াতে আল্লাহ তা‘আলা (نَعْبُدُ) ক্রিয়ার পূর্বে (إِيَّاكَ) কর্মপদকে নিয়ে এসেছেন সীমাবদ্ধতা বুঝানোর জন্য। অর্থাৎ আমরা একমাত্র আপনারই ইবাদত করি, অন্য কারো নয় এবং আপনার কাছেই সাহায্য চাই, অন্য কোন ব্যক্তি বা বস্তুর কাছে চাই না।</p><p>এটাই হল তাওহীদে উলুহিয়্যাহ</p><p class='arabic uthmani'>(توحيد الألوهية),</p><p>ইবাদাতের ক্ষেত্রে আল্লাহ তা‘আলার এককত্ব যা মুসলিমদের ও মুশরিকদের মাঝে পার্থক্য করে।</p><p>অধিকাংশ মুসলিমদের বিশ্বাস, আমরা আল্লাহ তা‘আলার ওপর বিশ্বাসী, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর ওপর বিশ্বাসী; তাই আমরা মুসলিম। আর যারা আল্লাহ তা‘আলাকে বিশ্বাস করে না তারা কাফির। এ ধারণা ভুল, কারণ মক্কার তৎকালীন মুশরিকগণ বিশ্বাস করত আল্লাহ তা‘আলা আছেন, আল্লাহ তা‘আলা একজন, তিনি সৃষ্টিকর্তা, রিযিকদাতা, জীবন ও মৃত্যুর মালিক এবং তাদের ভাল-মন্দের মালিক ইত্যাদি। মূলত এটা হল তাওহীদে রুবুবিয়্যাহ</p><p class='arabic uthmani'>(توحيد الربوبية)</p><p>তারা স্রষ্টা হিসেবে আল্লাহ তা‘আলার এককত্বের ওপর বিশ্বাসী ছিল। যেমন আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللّٰهُ)</p><p>“আর তুমি যদি তাদেরকে জিজ্ঞাসা কর, আসমান ও জমিন কে সৃষ্টি করেছেন? তবে তারা অবশ্যই বলবে ‘আল্লাহ’।”(সূরা যুমার ৩৯:৩৮)</p><p>আল্লাহ তা‘আলা আরো বলেন:</p><p class='arabic uthmani'>(وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ لَيَقُولُنَّ اللّٰهُ)</p><p>“যদি তুমি তাদেরকে জিজ্ঞাসা কর, ‘কে আকাশ ও পৃথিবী সৃষ্টি করেছেন এবং চাঁদ ও সূর্যকে নিয়ন্ত্রণ করছেন?’তারা অবশ্যই বলবে, ‘আল্লাহ’। (সূরা আনকাবুত ২৯:৬১)</p><p>অনুরূপভাবে সূরা লুকমানের ২৫ নং আয়াতে ও সূরা যুখরুফের ৯ নং আয়াতে মুশরিকদের তাওহীদে রুবুবিয়্যাহর স্বীকৃতির কথা উল্লেখ রয়েছে।</p><p>কিন্তু যদি কোন কিছুর প্রয়োজন হতো তাহলে তারা মূর্তির কাছে ধরনা দিত, তাদের কাছে সাহায্য চাইত অর্থাৎ সরাসরি তাওহীদে উলুহিয়্যাহ বিশ্বাস করত না। তাই একজন ব্যক্তি যতক্ষণ না তাওহীদে উলুহিয়্যাহর (ইবাদতের ক্ষেত্রে আল্লাহ তা‘আলার এককত্বের) ওপর বিশ্বাস করতঃ আমল করবে ততক্ষণ পর্যন্ত সে মু’মিন হতে পারবে না। ইবাদতে আল্লাহ তা‘আলার এককত্ব মেনে নেয়া মাত্র ব্যক্তির চাওয়া পাওয়াসহ সকল ইবাদত একমাত্র আল্লাহ তা‘আলার কাছেই হবে। আদেশ-নিষেধ ও বিধি-বিধান সবকিছু আল্লাহ তা‘আলারই মেনে চলবে এবং দু‘আ-প্রার্থনা, সিজদা, কুরবানী সবকিছু শুধুমাত্র আল্লাহ তা‘আলার জন্যই করবে।  এ তাওহীদ না থাকলে সে আল্লাহ তা‘আলা ছাড়া অন্য ব্যক্তি বা বস্তুর পূজা-উপাসনা করতে পারে, যেমন ছিল মক্কার মুশরিকদের অবস্থা।  অনেকে ধারণা করে ইবাদত শুধু সালাত, সিয়াম, হাজ্জ, যাকাত, কালেমা ইত্যাদি। এরূপ ধারণা সঠিক নয় বরং ইবাদত হলো: প্রত্যেক প্রকাশ্য ও অপ্রকাশ্য ঐ সকল কথা ও কাজ যা আল্লাহ তা‘আলা ভালবাসেন বা যা দ্বারা তাঁর সন্তুষ্টি অর্জন করা যায়।</p><p>আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(قُلْ إِنَّ صَلَاتِيْ وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلّٰهِ رَبِّ الْعَالَمِينَ)</p><p>“বল আমার সালাত, আমার কুরবানী, আমার জীবন ও আমার মরণ একমাত্র বিশ্বের প্রতিপালকের জন্য।”(সূরা আন‘আম ৬:১৬২)</p><p>ইবাদতের ক্ষেত্রে তাওহীদ প্রতিষ্ঠা করার জন্যই আল্লাহ তা‘আলা যুগে যুগে বিভিন্ন জাতির কাছে নাবী ও রাসূল প্রেরণ করেছেন। আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَّسُولًا أَنِ اعْبُدُوا اللّٰهَ وَاجْتَنِبُوا الطَّاغُوتَ)</p><p>“আমি প্রত্যেক জাতির কাছে রাসূল প্রেরণ করেছি এ মর্মে যে, (তারা বলবে) তোমরা একমাত্র আল্লাহর ইবাদত কর এবং তাগূতকে বর্জন কর।”(সূরা নাহল ১৬:৩৬)</p><p>আল্লাহ তা‘আলা আরো বলেন:</p><p class='arabic uthmani'>(وَاِلٰی عَادٍ اَخَاھُمْ ھُوْدًاﺚ قَالَ یٰقَوْمِ اعْبُدُوا اللہَ مَا لَکُمْ مِّنْ اِلٰھٍ غَیْرُھ۫)</p><p>“আদ জাতির নিকট তাদের ভ্রাতা হূদকে পাঠিয়েছিলাম। সে বলেছিল, ‘হে আমার সম্প্রদায়! তোমরা শুধু আল্লাহর ইবাদত করো। তিনি ব্যতীত তোমাদের অন্য কোন সত্যিকার মা‘বূদ নেই।” (সূরা হূদ ১১:৫০)</p><p>এরূপ সামূদ, সালেহ ও নূহসহ সকল নাবীদেরকে তাওহীদ বা আল্লাহ তা‘আলার এককত্ব প্রতিষ্ঠার দায়িত্ব দিয়ে আল্লাহ তা‘আলা প্রেরণ করেছেন। আমাদের নাবী, সর্বশেষ নাবী মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর দাওয়াত ও শিক্ষাও ছিল সেরূপ। তিনি মক্কার মানুষদের যখন বললেন:</p><p class='arabic uthmani'>قُوْلُوْا  لَا إلٰهَ إِلَا اللہَ تُفْلِحُوْا</p><p>‘বল, আল্লাহ তা‘আলা ব্যতীত সত্যিকার কোন মা‘বূদ নেই, তোমরা সফল হবে।’(সহীহ ইবনু খুযাইমা হা: ১৫৯) এ দাওয়াত পাওয়ার সাথে সাথে নিকটের মানুষ দূর হয়ে গেল, বন্ধু শত্র“ হয়ে গেল। রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সাহাবীদেরকে এ আকীদাহ ও আদর্শের ওপর গড়ে তুলেছেন। যেমন রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ছোট বালক আবদুল্লাহ ইবনু আব্বাস (রাঃ) কে বলেন:</p><p class='arabic uthmani'>يَا غُلَامُ إِنِّي أُعَلِّمُكَ كَلِمَاتٍ احْفَظْ اللّٰهَ يَحْفَظْكَ احْفَظْ اللّٰهَ تَجِدْهُ تُجَاهَكَ إِذَا سَأَلْتَ فَاسْأَلْ اللّٰهَ وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللّٰهِ</p><p>হে বৎস! আমি তোমাকে কিছু বাক্য শিক্ষা দেব। তুমি আল্লাহ তা‘আলার বিধানকে হেফাযত কর আল্লাহ তা‘আলা তোমাকে হেফাযত করবেন, তুমি আল্লাহ তা‘আলার বিধানকে হেফাযত কর (তাহলে) সর্বাবস্থায় তাঁকে পাবে। যখন কিছু চাবে তখন আল্লাহ তা‘আলার কাছেই চাবে, যখন সাহায্য চাবে তখন আল্লাহ তা‘আলার কাছেই সাহায্য চাবে। (তিরমিযী হা: ২৫১৬, মিশকাত হা: ৫৩০২, সহীহ)</p>"}]},{"id":6,"verse_number":6,"verse_key":"1:6","hizb_number":1,"rub_el_hizb_number":1,"ruku_number":1,"manzil_number":1,"sajdah_number":null,"text_uthmani":"ٱهْدِنَا ٱلصِّرَٰطَ ٱلْمُسْتَقِيمَ","page_number":1,"juz_number":1,"words":[{"id":6844,"position":1,"audio_url":"wbw/001_006_001.mp3","char_type_name":"word","text_uthmani":"ٱهْدِنَا","page_number":1,"line_number":5,"text":"ٱهْدِنَا","translation":{"text":"Guide us","language_name":"english"},"transliteration":{"text":"ih'dinā","language_name":"english"}},{"id":6845,"position":2,"audio_url":"wbw/001_006_002.mp3","char_type_name":"word","text_uthmani":"ٱلصِّرَٰطَ","page_number":1,"line_number":6,"text":"ٱلصِّرَٰطَ","translation":{"text":"(to) the path","language_name":"english"},"transliteration":{"text":"l-ṣirāṭa","language_name":"english"}},{"id":6846,"position":3,"audio_url":"wbw/001_006_003.mp3","char_type_name":"word","text_uthmani":"ٱلْمُسْتَقِيمَ","page_number":1,"line_number":6,"text":"ٱلْمُسْتَقِيمَ","translation":{"text":"the straight","language_name":"english"},"transliteration":{"text":"l-mus'taqīma","language_name":"english"}},{"id":6847,"position":4,"audio_url":null,"char_type_name":"end","text_uthmani":"٦","page_number":1,"line_number":6,"text":"٦","translation":{"text":"(6)","language_name":"english"},"transliteration":{"text":null,"language_name":"english"}}],"audio":{"url":"AbdulBaset/Mujawwad/mp3/001006.mp3","segments":[[0,1,850,1590],[1,2,1600,3550],[2,3,3560,9340]]},"translations":[{"id":1065247,"resource_id":106,"text":"Нисде Ахь тхо нийсачу новкъа<sup foot_note=111789>1</sup>,"},{"id":321005,"resource_id":56,"text":"求你引领我们正路，"}],"tafsirs":[{"id":171864,"resource_id":381,"text":""},{"id":67140,"resource_id":165,"text":"<p>আমাদেরকে সরল পথ দেখাও;</p><p>اهدِنَا (হিদায়াত) শব্দটি কয়েকটি অর্থে ব্যবহার হয়। যেমন, পথের দিক নির্দেশ করা, পথে পরিচালনা করা এবং গন্তব্যস্থানে পৌঁছিয়ে দেওয়া। আরবীতে এটাকে 'ইরশাদ', 'তাওফীক্ব', 'ইলহাম' এবং 'দালালাহ' ইত্যাদি শব্দে আখ্যায়িত করা হয়। অর্থ হল, আমাদেরকে সঠিক পথের দিকে দিক নির্দেশ কর, এ পথে চলার তাওফীক্ব দাও এবং এর উপর প্রতিষ্ঠিত রাখ, যাতে আমরা (আমাদের অভীষ্ট) তোমার সন্তুষ্টি লাভ করতে পারি। পক্ষান্তরে সরল-সঠিক পথ কেবল জ্ঞান-বুদ্ধি দ্বারা অর্জিত হয় না। এই সরল-সঠিক পথ হল সেই 'ইসলাম' যা নবী করীম (সাঃ) বিশ্ববাসীর সামনে পেশ করেছেন এবং যা বর্তমানে ক্বুরআন ও সহীহ হাদীসের মধ্যে সুরক্ষিত।</p>"}]},{"id":7,"verse_number":7,"verse_key":"1:7","hizb_number":1,"rub_el_hizb_number":1,"ruku_number":1,"manzil_number":1,"sajdah_number":null,"text_uthmani":"صِرَٰطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِمْ وَلَا ٱلضَّآلِّينَ","page_number":1,"juz_number":1,"words":[{"id":8411,"position":1,"audio_url":"wbw/001_007_001.mp3","char_type_name":"word","text_uthmani":"صِرَٰطَ","page_number":1,"line_number":6,"text":"صِرَٰطَ","translation":{"text":"(The) path","language_name":"english"},"transliteration":{"text":"ṣirāṭa","language_name":"english"}},{"id":8412,"position":2,"audio_url":"wbw/001_007_002.mp3","char_type_name":"word","text_uthmani":"ٱلَّذِينَ","page_number":1,"line_number":6,"text":"ٱلَّذِينَ","translation":{"text":"(of) those","language_name":"english"},"transliteration":{"text":"alladhīna","language_name":"english"}},{"id":8413,"position":3,"audio_url":"wbw/001_007_003.mp3","char_type_name":"word","text_uthmani":"أَنْعَمْتَ","page_number":1,"line_number":6,"text":"أَنْعَمْتَ","translation":{"text":"You have bestowed (Your) Favors","language_name":"english"},"transliteration":{"text":"anʿamta","language_name":"english"}},{"id":8414,"position":4,"audio_url":"wbw/001_007_004.mp3","char_type_name":"word","text_uthmani":"عَلَيْهِمْ","page_number":1,"line_number":7,"text":"عَلَيْهِمْ","translation":{"text":"on them","language_name":"english"},"transliteration":{"text":"ʿalayhim","language_name":"english"}},{"id":8415,"position":5,"audio_url":"wbw/001_007_005.mp3","char_type_name":"word","text_uthmani":"غَيْرِ","page_number":1,"line_number":7,"text":"غَيْرِ","translation":{"text":"not (of)","language_name":"english"},"transliteration":{"text":"ghayri","language_name":"english"}},{"id":8416,"position":6,"audio_url":"wbw/001_007_006.mp3","char_type_name":"word","text_uthmani":"ٱلْمَغْضُوبِ","page_number":1,"line_number":7,"text":"ٱلْمَغْضُوبِ","translation":{"text":"those who earned (Your) wrath","language_name":"english"},"transliteration":{"text":"l-maghḍūbi","language_name":"english"}},{"id":8417,"position":7,"audio_url":"wbw/001_007_007.mp3","char_type_name":"word","text_uthmani":"عَلَيْهِمْ","page_number":1,"line_number":7,"text":"عَلَيْهِمْ","translation":{"text":"on themselves","language_name":"english"},"transliteration":{"text":"ʿalayhim","language_name":"english"}},{"id":8418,"position":8,"audio_url":"wbw/001_007_008.mp3","char_type_name":"word","text_uthmani":"وَلَا","page_number":1,"line_number":8,"text":"وَلَا","translation":{"text":"and not","language_name":"english"},"transliteration":{"text":"walā","language_name":"english"}},{"id":8419,"position":9,"audio_url":"wbw/001_007_009.mp3","char_type_name":"word","text_uthmani":"ٱلضَّآلِّينَ","page_number":1,"line_number":8,"text":"ٱلضَّآلِّينَ","translation":{"text":"(of) those who go astray","language_name":"english"},"transliteration":{"text":"l-ḍālīna","language_name":"english"}},{"id":8420,"position":10,"audio_url":null,"char_type_name":"end","text_uthmani":"٧","page_number":1,"line_number":8,"text":"٧","translation":{"text":"(7)","language_name":"english"},"transliteration":{"text":null,"language_name":"english"}}],"audio":{"url":"AbdulBaset/Mujawwad/mp3/001007.mp3","segments":[[0,1,1550,2990],[1,2,3000,4730],[2,3,4740,6640],[3,4,6650,8760],[4,5,8770,9800],[5,6,9810,12460],[6,7,12470,14560],[7,8,14570,15410],[8,9,15420,24980]]},"translations":[{"id":1065248,"resource_id":106,"text":"Ахь шайна ниIмат деллачеран<sup foot_note=111790>1</sup>новкъа,\n        \n      \n      Хьо шайна оьгIаз<sup foot_note=111791>2</sup>ца ваханчеран а‚ тила<sup foot_note=111792>3</sup>ца беллачеран а новкъа."},{"id":326655,"resource_id":56,"text":"你所祐助者的路，不是受谴怒者的路，也不是迷误者的路。"}],"tafsirs":[{"id":67141,"resource_id":165,"text":"<p>তাদের পথ -- যাদেরকে তুমি নিয়ামত দান করেছ;[১] তাদের পথ -- যারা ক্রোধভাজন (ইয়াহুদী) নয় এবং যারা পথভ্রষ্টও (খ্রিষ্টান) নয়। [২] (আমীন)</p><p><b>[১]</b> এ হল 'স্বিরাত্বে মুস্তাক্বীম' তথা সরল পথের ব্যাখ্যা। অর্থাৎ, সেই সরল পথ হল ঐ পথ, যে পথে চলেছেন এমন লোকেরা যাঁদেরকে তুমি নিয়ামত, অনুগ্রহ ও পুরস্কার দান করেছ। আর নিয়ামত ও পুরস্কারপ্রাপ্ত দলটি হল নবী, শহীদ, চরম সত্যবাদী (নবীর সহচর) এবং নেক লোকদের দল। যেমন আল্লাহ সূরা নিসার মধ্যে বলেছেন, \"আর যে কেউ আল্লাহ এবং রসূলের আনুগত্য করবে (শেষ বিচারের দিন) সে তাদের সঙ্গী হবে, যাদের প্রতি আল্লাহ অনুগ্রহ করেছেন; অর্থাৎ নবী, সিদ্দীক, শহীদ ও সৎকর্মশীলগণ। আর সঙ্গী হিসাবে এরা অতি উত্তম।।\" <em>(সূরা নিসা ৪:৬৯)</em> এই আয়াতে এ কথাও পরিষ্কার ক'রে বলে দেওয়া হয়েছে যে, পুরস্কারপ্রাপ্ত এই লোকদের পথ হল আল্লাহ ও তাঁর রসূলের আনুগত্যের পথ, অন্য কোন পথ নয়।</p><p><b>[২]</b> কোন কোন বর্ণনা দ্বারা সুসাব্যস্ত যে, مَغْضُوْبٌ عَلَيْهِمْ (ক্রোধভাজনঃ যাদের উপর আল্লাহর গযব নাযিল হয়েছে তারা) হল ইয়াহুদী। আর ضَالِّيْنَ (পথভ্রষ্ট) বলতে খ্রিষ্টানদেরকে বুঝানো হয়েছে। ইবনে আবী হাতেম বলেন, মুফাসসিরীনদের মধ্যে এ ব্যাপারে কোন মতভেদ নেই যে, {المَغْضُوبِ عَلَيْهِمْ} হল ইয়াহুদীরা এবং{الضَّالِّينَ} হল খ্রিষ্টানরা। <em>(ফাতহুল ক্বাদীর)</em> তাই সঠিক পথে চলতে ইচ্ছুক ব্যক্তিদের জন্য অত্যাবশ্যক হল যে, তারা ইয়াহুদী এবং খ্রিষ্টান উভয় জাতিরই ভ্রষ্টতা থেকে নিজেদেরকে বাঁচিয়ে রাখবে। ইয়াহুদীদের সব থেকে বড় ভ্রষ্টতা এই ছিল যে, তারা জেনে-শুনেও সঠিক পথ অবলম্বন করেনি। তারা আল্লাহর আয়াতসমূহের বিকৃতি ও অপব্যাখ্যা করতে কোন প্রকার কুণ্ঠাবোধ করতো না। তারা উযাইর (আঃ)-কে আল্লাহর পুত্র বলতো। তাদের পন্ডিত ও সাধু-সন্নাসীদের হালাল ও হারাম করার অধিকার আছে বলে মনে করতো। আর খ্রিষ্টানদের সব থেকে বড় ত্রুটি এই ছিল যে, তারা ঈসা (আঃ)-এর ব্যাপারে বাড়াবাড়ি ক'রে তাঁকে আল্লাহর পুত্র এবং তিনের এক সাব্যস্ত করেছে। দুঃখের বিষয় যে, উম্মাতে মুহাম্মাদিয়ার মধ্যেও এই ভ্রষ্টতা ব্যাপক রূপ ধারণ করেছে। যার কারণে তারা দুনিয়াতে লাঞ্ছিত এবং ঘৃণিত হচ্ছে। আল্লাহ তাআলা তাদেরকে ভ্রষ্টতার গহ্বর থেকে বের করুন; যাতে তারা অবনতি ও দুর্দশার বর্ধমান অগ্নিগ্রাস থেকে সুরক্ষিত থাকে।</p><p>সূরা ফাতিহার শেষে 'আ-মীন' বলার ব্যাপারে নবী করীম (সাঃ) খুব তাকীদ করেছেন এবং তার ফযীলতও উল্লেখ করেছেন। কাজেই ইমাম এবং মুক্তাদী সকলের 'আ-মীন' বলা উচিত। নবী করীম (সাঃ) এবং তাঁর সাহাবাগণ জেহরী (সশব্দে পঠনীয়) নামাযগুলোতে উচ্চস্বরে এমন ভাবে 'আ-মীন' বলতেন যে, মসজিদ গমগম করে উঠত। <em>(ইবনে মাজা-ইবনে কাসীর)</em> বলাই বাহুল্য যে, উঁচু শব্দে 'আ-মীন' বলা নবী করীম (সাঃ)-এর সুন্নত এবং সাহাবায়ে কেরাম (রাঃ)-দের কৃত আমল।</p><p>আ-মীনের কয়েকটি অর্থ বলা হয়েছে। যেমনঃ (كَذَلِكَ فَلْيَكُنْ) এই রকমই হোক। (لاَ تُخَيِّبْ رَجَآءَنَا) আমাদের আশা ব্যর্থ করো না। (اللَّهُمَّ اسْتَجِبْ لَنَا) হে আল্লাহ! আমাদের দুআ কবুল কর।</p>"},{"id":171865,"resource_id":381,"text":"<p><b> ৬-৭ নং আয়াতের তাফসীর:  </b></p><p>‘আমাদেরকে সরল সঠিক পথ প্রদর্শন করুন।’অর্থাৎ আমাদেরকে সরল পথ প্রদর্শন করত আপনার সাথে সাক্ষাত পর্যন্ত তার ওপর বহাল থাকার তাওফীক দান করুন। (তাফসীর মুয়াসসার, অত্র আয়াতের তাফসীর)</p><p><b> হিদায়াত (هِدَايَةٌ) দুই প্রকার: </b></p><p>১. هِدَايَةُ الْاِرْشَادِ وَالْدَّلَالَةِ</p><p>(হিদায়াতুল ইরশাদ ওয়াদ দালালাহ): পথ প্রদর্শন ও নির্দেশনামূলক হিদায়াত। নাবী-রাসূলসহ সকল মানুষ এ প্রকার হিদায়াত বা পথপ্রদর্শন করতে পারে। যেমন আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَإِنَّكَ لَتَهْدِيْ إِلٰي صِرَاطٍ مُسْتَقِيمٍ)</p><p>“তুমি অবশ্যই সরল পথের পথ প্রদর্শন করবে।”(সূরা শুরা ৪২:৫২) অর্থাৎ সরল পথের পথ নির্দেশনা দিবে।</p><p class='arabic uthmani'>২. هِدَايَةُ التَّوْفِيْقِ</p><p>(হিদায়াতুত্ তাওফীক): সরল সঠিক পথ গ্রহণ ও তাতে প্রতিষ্ঠিত থাকার তাওফীক দান করা। এ প্রকার হিদায়াত শুধু আল্লাহ তা‘আলার হাতে।</p><p>আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(إِنَّكَ لَا تَهْدِيْ مَنْ أَحْبَبْتَ وَلٰكِنَّ اللّٰهَ يَهْدِيْ مَنْ يَّشَا۬ءُ)</p><p>“তুমি যাকে ভালবাস, ইচ্ছা করলেই তাকে সৎপথে হিদায়াত দিতে পারবে না। তবে আল্লাহ যাকে ইচ্ছা সৎপথে হিদায়াত দেন। (সূরা কাসাস ২৮:৫৬)</p><p><b> সিরাতুল মুস্তাকীম </b></p><p class='arabic uthmani'>(اَلصِّرَاطُ الْمُسْتَقِيْمُ)</p><p>সম্পর্কে ইমাম সাওরী (রহঃ) বলেন: সিরাতুল মুস্তাকীম হল আল্লাহ তা‘আলার কিতাব। কেউ বলেছেন: ইসলাম, বিশিষ্ট তাবিঈ মুজাহিদ (রহঃ) বলেন: সিরাতুল মুস্তাকীম দ্বারা উদ্দেশ্য হল اَلْحَقُّ বা সত্য। তাবিঈ মুজাহিদের মতটিই অন্যান্য মুফাসসিরদের মতামতকে অন্তর্ভুক্ত করে এবং পূর্বের মতামতের সাথেও এর কোন বিরোধ নেই। (তাফসীর ইবনে কাসীর, অত্র আয়াতের তাফসীর)</p><p>তবে সবচেয়ে গ্রহণযোগ্য মত-</p><p class='arabic uthmani'>(اَلصِّرَاطُ الْمُسْتَقِيْمُ)</p><p>(সিরাতুল মুস্তাকীম) হল اَلْإِسْلَامُ (ইসলাম)। (তাফসীর মুয়াসসার পৃঃ ১) সুতরাং বলা যেতে পারে যে, ওয়াহী তথা কুরআন ও সহীহ হাদীসের আলোকে পূর্ণভাবে ইসলামের ওপর প্রতিষ্ঠিত থাকার নামই হল সিরাতুল মুস্তাকীমে থাকা।</p><p>সিরাতুল মুস্তাকীমের বর্ণনা দিতে একদা রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) নিজ হাতে একটি লম্বা রেখা টানলেন এবং বললেন, এটা হল আল্লাহ তা‘আলার সরল পথ। আরো কিছু রেখা তাঁর ডান ও বাম পাশে টানলেন এবং বললেন, এগুলো হল এমন পথ যার ওপর শয়তান বসে আছে এবং সে এ পথগুলোর দিকে মানুষকে আহ্বান করে। তারপর রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তিলায়ওয়াত করলেন</p><p class='arabic uthmani'>(وَأَنَّ هٰذَا صِرَاطِيْ مُسْتَقِيْمًا)</p><p>‘আর নিশ্চয়ই এ পথই আমার সহজ-সরল পথ’- আয়াত । (মুসনাদ আহমাদ হা: ৪১৪২, সহীহ) এ সিরাতে মুস্তাকীম হল, মুসলিম উম্মাহর মূল ভিত্তি। এ সরল পথ থেকে দূরে সরে পড়ার কারণে উম্মত বিভিন্ন দলে উপদলে বিভক্ত। অতএব সেই সরল পথে ফিরে আসতে হলে রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর নির্দেশ মত সকল পথ, মত ও তরীকা বর্জন করে কুরআন ও সহীহ হাদীসের মাধ্যমে ইসলাম মেনে চলতে হবে। রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন:</p><p class='arabic uthmani'>تَرَكْتُ فِيكُمْ أَمْرَيْنِ لَنْ تَضِلُّوا مَا تَمَسَّكْتُمْ بِهِمَا كِتَابَ اللّٰهِ وَسُنَّةَ نَبِيِّهِ</p><p>আমি তোমাদের মাঝে দু’টি বিষয় রেখে যাচ্ছি, যতদিন তা আকড়ে ধরে থাকবে ততদিন পথভ্রষ্ট হবে না। সে দু’টি বিষয় হল, আল্লাহ তা‘আলার কিতাব কুরআন ও তাঁর নাবীর সুন্নাত (হাদীস)। (মুয়াত্তা মালিক হা: ৩৩৩৮, হাকীস, সহীহ হা: ২৯১)</p><p class='arabic uthmani'>(صِرَاطَ الَّذِیْنَ اَنْعَمْتَ...)</p><p>-যাদের প্রতি আল্লাহ তা‘আলা অনুগ্রহ করেছেন তাদের বর্ণনা এ আয়াতে না থাকলেও সূরা নিসার ৬৯ নং আয়াতে এসেছে। আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَمَنْ يُّطِعِ اللّٰهَ وَالرَّسُوْلَ فَأُولٰٓئِكَ مَعَ الَّذِيْنَ أَنْعَمَ اللّٰهُ عَلَيْهِمْ مِّنَ النَّبِيِّيْنَ وَالصِّدِّيْقِيْنَ وَالشُّهَدَآءِ وَالصّٰلِحِيْنَ ج وَحَسُنَ أُولٰ۬ئِكَ رَفِيْقًا)</p><p>“আর যে ব্যক্তি আল্লাহ এবং রাসূলের আনুগত্য করবে সে নাবী, সিদ্দীক, শহীদ ও সৎ কর্মশীল- যাদের প্রতি আল্লাহ অনুগ্রহ করেছেন- তাদের সঙ্গী হবে এবং তারা কতই না উত্তম সঙ্গী!” (সূরা নিসা ৪:৬৯) অর্থাৎ আল্লাহর অনুগ্রহপ্রাপ্তরা চার শ্রেণির: নাবী-রাসূল, সিদ্দীক, শহীদ ও সালিহ বা সৎ কর্মশীলগণ।</p><p class='arabic uthmani'>(غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّا۬لِّيْنَ)</p><p>‘তাদের পথ নয় যারা গযবপ্রাপ্ত এবং তাদের পথও নয় যারা পথভ্রষ্ট’আদি বিন হাতেম (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: গযবপ্রাপ্ত (الْمَغْضُوبِ) হল ইয়াহূদীগণ, আর পথভ্রষ্ট (الضَّا۬لِّيْنَ) হল খ্রিস্টানগণ। (তিরমিযী হা: ২৯৫৪, সহীহ, ইবনে হিব্বান ৮/৪৮)</p><p>এরূপ আরো অনেক মত রয়েছে। যাতে ইয়াহূদীদেরকে গযবপ্রাপ্ত ও খ্রিস্টানদেরকে পথভ্রষ্ট বলা হয়েছে। (তাফসীরে তাবারী ১/১৪৬) ইয়াহূদীগণ গযবপ্রাপ্ত, কারণ তারা জানত কিন্তু মানত না, আর খ্রিস্টানগণ পথভ্রষ্ট কারণ তারা না জেনেশুনেই আমল করত। (আযওয়াউল বায়ান ১/৬০)</p><p>ইয়াহূদীদের ব্যাপারেই আল্লাহ তা‘আলা বলেছেন:</p><p class='arabic uthmani'>(فَبَا۬ءُوْا  بِغَضَبٍ عَلٰی غَضَبٍ)</p><p>“অতঃপর তারা গযবের পর গযবে পতিত হয়েছে।”(সূরা বাকারাহ ২:৯০) আল্লাহ তা‘আলা আরো বলেন:</p><p class='arabic uthmani'>(قُلْ ھَلْ اُنَبِّئُکُمْ بِشَرٍّ مِّنْ ذٰلِکَ مَثُوْبَةً عِنْدَ اللہِﺚ مَنْ لَّعَنَھُ اللہُ وَغَضِبَ عَلَیْھِ)</p><p>“আমি কি তোমাদেরকে এর চেয়ে নিকৃষ্ট পরিণামের সংবাদ দেব যা আল্লাহর নিকট আছে? যাকে আল্লাহ লা‘নত করেছেন এবং যার ওপর তিনি গযব দিয়েছেন (এরা প্রতিদানের দিক দিয়ে কিয়ামতের দিন আল্লাহর কাছে সবচেয়ে নিকৃষ্ট)।”(সূরা মায়িদাহ ৫:৬০)</p><p>আল্লাহ তা‘আলা অন্যত্র বলেন:</p><p class='arabic uthmani'>(إِنَّ الَّذِينَ اتَّخَذُوا الْعِجْلَ سَيَنَالُهُمْ غَضَبٌ مِّنْ رَّبِّهِمْ وَذِلَّةٌ فِي الْحَيَاةِ الدُّنْيَا)</p><p>“নিশ্চয়ই যারা গো-বৎসকে মা‘বূদরূপে গ্রহণ করেছে, পার্থিব জীবনে তাদের ওপর তাদের প্রতিপালকের গযব ও লাঞ্ছনা পতিত হবেই।”(সূরা আরাফ ৭:১৫২)</p><p>আর পথভ্রষ্ট খ্রিস্টানদের ব্যাপারে মু’মিনদেরকে সতর্ক করে আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(لَا تَغْلُوْا فِیْ دِیْنِکُمْ غَیْرَ الْحَقِّ وَلَا تَتَّبِعُوْٓا اَھْوَا۬ئَ قَوْمٍ قَدْ ضَلُّوْا مِنْ قَبْلُ وَاَضَلُّوْا کَثِیْرًا وَّضَلُّوْا عَنْ سَوَا۬ئِ السَّبِیْلِ)</p><p>“তোমরা তোমাদের দীন সম্বন্ধে অন্যায়ভাবে বাড়াবাড়ি কর না এবং যে সম্প্রদায় ইতোপূর্বে পথভ্রষ্ট হয়েছে, অনেককে পথভ্রষ্ট করেছে ও সরল পথ হতে বিচ্যুত হয়েছে, তাদের খেয়াল-খুশির অনুসরণ কর না।”(সূরা মায়িদাহ ৫:৭৭)</p><p>অতএব আমরা প্রত্যহ সালাতে আল্লাহ তা‘আলার কাছে নাবী রাসূলদের পথে চলার এবং ইয়াহূদ খ্রিস্টানদের পথে না চলার বিনীত আবেদন করি, কিন্তু বাস্তব জীবনে যদি সচেতন না হই তাহলে এ আবেদন ফলপ্রসূ হবে না। সুতরাং বাস্তবে সেভাবে চলা প্রতিটি মু’মিনের একান্ত কর্তব্য এবং মনে রাখতে হবে যে, খ্রিস্টানদের স্বভাব হল না জেনে অন্ধ ও অজ্ঞের মত ইবাদত করা। আর ইয়াহূদীদের স্বভাব হল জানার পরও সে অনুযায়ী আমল না করা। সুতরাং খাঁটি মুসলিমের পথ হল কুরআন ও সহীহ হাদীসের আলোকে জেনে-শুনে ইবাদত করা এবং কুরআন ও সহীহ হাদীস জানতে পারলে মাযহাব, তরীকা ও দাপ-দাদার দোহাই না দিয়ে আল্লাহ তা‘আলাকে ভয় করে সে অনুযায়ী আমল করা। আল্লাহ তা‘আলা আমাদের তাওফীক দান করুন। আমীন!</p><p><b> আমীন বলার ফযীলত ও তাৎপর্য: </b></p><p>(آمِيْن) আমীন অর্থ- হে আল্লাহ! তুমি কবূল কর। রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যখন সালাতে সূরা ফাতিহা পড়া শেষ করতেন, তখন আমীন বলতেন। যদি তাঁর কিরাআত আওয়াজের সাথে হতো তাহলে আমীনও সেরূপ আওয়াজের সাথে হতো এবং পেছনে যারা থাকতেন তারাও আমীন বলতেন।</p><p>সাহাবী ওয়ায়েল ইবনু হুজর (রাঃ) বলেন:</p><p class='arabic uthmani'>سَمِعْتُ النَّبِيَّ صلي اللّٰه عليه و سلم قَرَأَ ( غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّالِّيْنْ) فَقَالَ آمِيْن وَمَدَّ بِهَا صَوْتَهُ</p><p>আমি নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে “গাইরিল মাগযূবি ‘আলাইহিম ওয়ালায-যল্লীন” পড়ার পর সরবে আমীন বলতে শুনেছি। (তিরমিযী হা: ২৪৮, মিশকাত হা: ৮৪৫, সহীহ)</p><p>আবূ হুরায়রা (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন:</p><p class='arabic uthmani'>إِذَا أَمَّنَ الإِمَامُ فَأَمِّنُوا فَإِنَّهُ مَنْ وَافَقَ تَأْمِينُهُ تَأْمِيْنَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ</p><p>ইমাম যখন আমীন বলবে তখন তোমরাও আমীন বল। কেননা যার আমীন বলা ফেরেশতাদের আমীনের সাথে মিলে যাবে তার পূর্বের গুনাহসমূহ ক্ষমা করে দেয়া হয়। (সহীহ বুখারী হা: ৭৮০, সহীহ মুসলিম হা: ৯৪২)</p><p>সাহাবী ওয়ায়েল ইবনু হুজর (রাঃ) হতে আরো বর্ণিত আছে, তিনি বলেন:</p><p class='arabic uthmani'>كَانَ رَسُولُ اللّٰهِ -صلي اللّٰه عليه وسلم- إِذَا قَرَأَ ( وَلاَ الضَّالِّينَ) قَالَ آمِين وَرَفَعَ بِهَا صَوْتَهُ</p><p>রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যখন “ওয়ালায-যল্লীন”বলতেন তখন আমীন বলতেন। তিনি আমীনের আওয়াজটা জোরে করতেন। (আবূ দাউদ হা: ৯৩২, সহীহ) ইমাম বুখারী বলেন:</p><p class='arabic uthmani'>بَاب جَهْرِ الْإِمَامِ بِالتَّأْمِينِ وَقَالَ عَطَاءٌ آمِينَ دُعَاءٌ أَمَّنَ ابْنُ الزُّبَيْرِ وَمَنْ وَرَاءَهُ حَتّٰي إِنَّ لِلْمَسْجِدِ لَلَجَّةً....</p><p>“অনুচ্ছেদ: ইমামের উচ্চৈঃস্বরে আমীন বলা সম্পর্কে, তাবেয়ী আত্বা (রহঃ) বলেন: আমীন হল দু‘আ। সাহাবী ইবনু যুবাইর (রাঃ) ও তাঁর পেছনের মুক্তাদীরা এমন জোরে আমীন বলতেন যাতে মসজিদ আওয়াজে গমগম করে উঠত...।” (সহীহ বুখারী ১/১০৭, কিতাবুল আযান, অনুচ্ছেদ: ইমামের উচ্চৈঃস্বরে আমীন বলা সম্পর্কে)  তখন থেকে আজও পর্যন্ত আল্লাহ তা‘আলার ঘর কা‘বা এবং নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর মাসজিদ আমীনের আওয়াজে গমগম করছে। আমীন সরবে বলার স্বপক্ষে নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে</p><p class='arabic uthmani'>رَفَعَ  ،  مَدَّ  ، جَهَرَ ، اِرْ تَجَّ</p><p>এ চারটি শব্দ বর্ণিত হয়েছে, যা প্রমাণ করে যে, নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সরব কিরাআতে আমীন কখনও নিরবে ছিল না। (আবূ দাউদ হা: ৯৩২, ৯৩৪, তিরমিযী হা: ২৪৮, সহীহ) এটাই রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সুন্নাত।</p><p>আয়িশাহ (রাঃ) ও ইবনু আব্বাস (রাঃ) থেকে বর্ণিত, নাবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন: তোমাদের সালাম করা ও সালাতে উঁচু আওয়াজে আমীন বলাতে ইয়াহূদীদের যত হিংসা হয় আর কোন জিনিসে ওদের এত হিংসা হয় না। অতএব তোমরা খুব বেশি বেশি করে আমীন বলো। (সহীহ ইবনু খুযাইমাহ হা: ১৫৮৫, ইবনু মাযাহ হা: ৮৫৬) তাই ইয়াহূদীদের পথে না গিয়ে সহীহ হাদীসের ওপর আমল করা কর্তব্য। আমীন বলার ফযীলত যে কত বড় তা গভীরভাবে অনুধাবন করা উচিত। কিন্তু নিয়ম হলো ইমামের আমীন শুনে মুক্তাদীরা আমীন বলবে, ইমামের আগে নয় এবং পৃথকভাবে পরেও নয়। আল্লাহ তা‘আলা আমাদের সঠিকভাবে আমল করার তাওফীক দান করুন। আমীন!</p><p><b> সূরা থেকে শিক্ষণীয় বিষয়সমূহ: </b></p><p>১. ‘বিসমিল্লাহ...’সূরা ফাতিহার প্রথম আয়াত। তবে সালাতে তা নিরবে পড়তে হবে।</p><p>২. সূরা ফাতিহার একাধিক নাম ও ফযীলত অবগত হলাম।</p><p>৩. সালাতে সূরা ফাতিহা পাঠ করা অপরিহার্য, কারণ সূরা ফাতিহা ছাড়া কোন ব্যক্তির কোন সালাত হবে না।</p><p>৪. তাওহীদ এর সঠিক পরিচয় এবং তাওহীদ তিন প্রকার- এ সম্পর্কে অবগত হলাম।</p><p>৫. সূরা ফাতিহায় আমরা দু‘আর পদ্ধতি অবগত হই, প্রথমে আল্লাহ তা‘আলার প্রশংসা করতে হবে তারপর তাঁর কাছে চাইতে হবে।</p><p>৫. আল্লাহ তা‘আলা প্রতিফল দিবসের মালিক, তিনি মানুষের পার্থিব জীবনের প্রতিটি ভাল-মন্দ কর্মের প্রতিফল দেবেন। সেজন্য প্রত্যেক মানুষকে মৃত্যুর পর পুনরুত্থান করাবেন।</p><p>৬. সিজদা, সালাত, সিয়াম ও দু‘আসহ সকল প্রকার ইবাদত পাওয়ার একমাত্র হকদার আল্লাহ তা‘আলা এবং সকল প্রকার আবেদন ও নিবেদন একমাত্র তাঁরই কাছে হতে হবে।</p><p>৭. জানা ও মানা দু’টিই আবশ্যক। জানার পর না মানলে যেমন নিন্দনীয় ও অমার্জনীয় তেমনি না জেনে আমল করাও নিন্দনীয়।</p><p>৮. এ সূরায় আল্লাহ তা‘আলার তাওহীদ এর বিষয়টি পূর্ণাঙ্গভাবে আলোচিত হয়েছে।</p><p>৯. সরবে কিরাআতবিশিষ্ট সালাতে সূরা ফাতিহা পাঠ শেষে ইমাম মুক্তাদি সকলের সরবে আমীন বলা রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ও সাহাবীদের সুন্নাত।</p>"}]}]
/// pagination : {"per_page":10,"current_page":1,"next_page":null,"total_pages":1,"total_records":7}

VersesModel versesModelFromJson(String str) => VersesModel.fromJson(json.decode(str));
String versesModelToJson(VersesModel data) => json.encode(data.toJson());
class VersesModel {
  VersesModel({
      List<Verses>? verses, 
      Pagination? pagination,}){
    _verses = verses;
    _pagination = pagination;
}

  VersesModel.fromJson(dynamic json) {
    if (json['verses'] != null) {
      _verses = [];
      json['verses'].forEach((v) {
        _verses?.add(Verses.fromJson(v));
      });
    }
    _pagination = json['pagination'] != null ? Pagination.fromJson(json['pagination']) : null;
  }
  List<Verses>? _verses;
  Pagination? _pagination;
VersesModel copyWith({  List<Verses>? verses,
  Pagination? pagination,
}) => VersesModel(  verses: verses ?? _verses,
  pagination: pagination ?? _pagination,
);
  List<Verses>? get verses => _verses;
  Pagination? get pagination => _pagination;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    if (_verses != null) {
      map['verses'] = _verses?.map((v) => v.toJson()).toList();
    }
    if (_pagination != null) {
      map['pagination'] = _pagination?.toJson();
    }
    return map;
  }

}

/// per_page : 10
/// current_page : 1
/// next_page : null
/// total_pages : 1
/// total_records : 7

Pagination paginationFromJson(String str) => Pagination.fromJson(json.decode(str));
String paginationToJson(Pagination data) => json.encode(data.toJson());
class Pagination {
  Pagination({
      num? perPage, 
      num? currentPage, 
      dynamic nextPage, 
      num? totalPages, 
      num? totalRecords,}){
    _perPage = perPage;
    _currentPage = currentPage;
    _nextPage = nextPage;
    _totalPages = totalPages;
    _totalRecords = totalRecords;
}

  Pagination.fromJson(dynamic json) {
    _perPage = json['per_page'];
    _currentPage = json['current_page'];
    _nextPage = json['next_page'];
    _totalPages = json['total_pages'];
    _totalRecords = json['total_records'];
  }
  num? _perPage;
  num? _currentPage;
  dynamic _nextPage;
  num? _totalPages;
  num? _totalRecords;
Pagination copyWith({  num? perPage,
  num? currentPage,
  dynamic nextPage,
  num? totalPages,
  num? totalRecords,
}) => Pagination(  perPage: perPage ?? _perPage,
  currentPage: currentPage ?? _currentPage,
  nextPage: nextPage ?? _nextPage,
  totalPages: totalPages ?? _totalPages,
  totalRecords: totalRecords ?? _totalRecords,
);
  num? get perPage => _perPage;
  num? get currentPage => _currentPage;
  dynamic get nextPage => _nextPage;
  num? get totalPages => _totalPages;
  num? get totalRecords => _totalRecords;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['per_page'] = _perPage;
    map['current_page'] = _currentPage;
    map['next_page'] = _nextPage;
    map['total_pages'] = _totalPages;
    map['total_records'] = _totalRecords;
    return map;
  }

}

/// id : 1
/// verse_number : 1
/// verse_key : "1:1"
/// hizb_number : 1
/// rub_el_hizb_number : 1
/// ruku_number : 1
/// manzil_number : 1
/// sajdah_number : null
/// text_uthmani : "بِسْمِ ٱللَّهِ ٱلرَّحْمَـٰنِ ٱلرَّحِيمِ"
/// page_number : 1
/// juz_number : 1
/// words : [{"id":1,"position":1,"audio_url":"wbw/001_001_001.mp3","char_type_name":"word","text_uthmani":"بِسْمِ","page_number":1,"line_number":2,"text":"بِسْمِ","translation":{"text":"In (the) name","language_name":"english"},"transliteration":{"text":"bis'mi","language_name":"english"}},{"id":2,"position":2,"audio_url":"wbw/001_001_002.mp3","char_type_name":"word","text_uthmani":"ٱللَّهِ","page_number":1,"line_number":2,"text":"ٱللَّهِ","translation":{"text":"(of) Allah","language_name":"english"},"transliteration":{"text":"l-lahi","language_name":"english"}},{"id":3,"position":3,"audio_url":"wbw/001_001_003.mp3","char_type_name":"word","text_uthmani":"ٱلرَّحْمَـٰنِ","page_number":1,"line_number":2,"text":"ٱلرَّحْمَـٰنِ","translation":{"text":"the Most Gracious","language_name":"english"},"transliteration":{"text":"l-raḥmāni","language_name":"english"}},{"id":4,"position":4,"audio_url":"wbw/001_001_004.mp3","char_type_name":"word","text_uthmani":"ٱلرَّحِيمِ","page_number":1,"line_number":2,"text":"ٱلرَّحِيمِ","translation":{"text":"the Most Merciful","language_name":"english"},"transliteration":{"text":"l-raḥīmi","language_name":"english"}},{"id":5,"position":5,"audio_url":null,"char_type_name":"end","text_uthmani":"١","page_number":1,"line_number":2,"text":"١","translation":{"text":"(1)","language_name":"english"},"transliteration":{"text":null,"language_name":"english"}}]
/// audio : {"url":"AbdulBaset/Mujawwad/mp3/001001.mp3","segments":[[0,1,0,960],[1,2,970,1420],[2,3,1430,2670],[3,4,2680,6210]]}
/// translations : [{"id":1065242,"resource_id":106,"text":"Ша сов къинхетаме<sup foot_note=111781>1</sup> а‚ къинхетаме<sup foot_note=111782>2</sup> а волчу Делан цIарца."},{"id":325425,"resource_id":56,"text":"奉至仁至慈的真主之名"}]
/// tafsirs : [{"id":67135,"resource_id":165,"text":"<p>অনন্ত করুণাময় পরম দয়ালু আল্লাহর নামে (আরম্ভ করছি)।</p><p>'বিসমিল্লাহ'র পূর্বে 'আক্বরাউ' 'আবদাউ' অথবা 'আতলু' ফে'ল (ক্রিয়া) উহ্য আছে। অর্থাৎ, আল্লাহর নাম নিয়ে পড়ছি অথবা শুরু করছি কিংবা তেলাঅত আরম্ভ করছি। প্রত্যেক গুরুত্বপূর্ণ কাজ আরম্ভ করার পূর্বে 'বিসমিল্লাহ' পড়ার প্রতি তাকীদ করা হয়েছে। সুতরাং নির্দেশ করা হয়েছে যে, খাওয়া, যবেহ করা, ওযু করা এবং সহবাস করার পূর্বে 'বিসমিল্লাহ' পড়। অবশ্য ক্বুরআনে করীম তেলাঅত করার সময় 'বিসমিল্লাহির রাহমানির রাহীম' পড়ার পূর্বে 'আউযু বিল্লাহি মিনাশ্শায়ত্বানির রাজীম' পড়াও অত্যাবশ্যক। মহান আল্লাহ বলেছেন, \"অতএব যখন তুমি ক্বুরআন পাঠ করবে, তখন বিতাড়িত শয়তান থেকে আল্লাহর আশ্রয় প্রার্থনা কর।\" <em>(সূরা নাহল ১৬:৯৮ আয়াত)।</em></p>"},{"id":178095,"resource_id":381,"text":""}]

Verses versesFromJson(String str) => Verses.fromJson(json.decode(str));
String versesToJson(Verses data) => json.encode(data.toJson());
class Verses {
  Verses({
      num? id, 
      num? verseNumber, 
      String? verseKey, 
      num? hizbNumber, 
      num? rubElHizbNumber, 
      num? rukuNumber, 
      num? manzilNumber, 
      dynamic sajdahNumber, 
      String? textUthmani, 
      num? pageNumber, 
      num? juzNumber, 
      List<Words>? words, 
      Audio? audio, 
      List<Translations>? translations, 
      List<Tafsirs>? tafsirs,}){
    _id = id;
    _verseNumber = verseNumber;
    _verseKey = verseKey;
    _hizbNumber = hizbNumber;
    _rubElHizbNumber = rubElHizbNumber;
    _rukuNumber = rukuNumber;
    _manzilNumber = manzilNumber;
    _sajdahNumber = sajdahNumber;
    _textUthmani = textUthmani;
    _pageNumber = pageNumber;
    _juzNumber = juzNumber;
    _words = words;
    _audio = audio;
    _translations = translations;
    _tafsirs = tafsirs;
}

  Verses.fromJson(dynamic json) {
    _id = json['id'];
    _verseNumber = json['verse_number'];
    _verseKey = json['verse_key'];
    _hizbNumber = json['hizb_number'];
    _rubElHizbNumber = json['rub_el_hizb_number'];
    _rukuNumber = json['ruku_number'];
    _manzilNumber = json['manzil_number'];
    _sajdahNumber = json['sajdah_number'];
    _textUthmani = json['text_uthmani'];
    _pageNumber = json['page_number'];
    _juzNumber = json['juz_number'];
    if (json['words'] != null) {
      _words = [];
      json['words'].forEach((v) {
        _words?.add(Words.fromJson(v));
      });
    }
    _audio = json['audio'] != null ? Audio.fromJson(json['audio']) : null;
    if (json['translations'] != null) {
      _translations = [];
      json['translations'].forEach((v) {
        _translations?.add(Translations.fromJson(v));
      });
    }
    if (json['tafsirs'] != null) {
      _tafsirs = [];
      json['tafsirs'].forEach((v) {
        _tafsirs?.add(Tafsirs.fromJson(v));
      });
    }
  }
  num? _id;
  num? _verseNumber;
  String? _verseKey;
  num? _hizbNumber;
  num? _rubElHizbNumber;
  num? _rukuNumber;
  num? _manzilNumber;
  dynamic _sajdahNumber;
  String? _textUthmani;
  num? _pageNumber;
  num? _juzNumber;
  List<Words>? _words;
  Audio? _audio;
  List<Translations>? _translations;
  List<Tafsirs>? _tafsirs;
Verses copyWith({  num? id,
  num? verseNumber,
  String? verseKey,
  num? hizbNumber,
  num? rubElHizbNumber,
  num? rukuNumber,
  num? manzilNumber,
  dynamic sajdahNumber,
  String? textUthmani,
  num? pageNumber,
  num? juzNumber,
  List<Words>? words,
  Audio? audio,
  List<Translations>? translations,
  List<Tafsirs>? tafsirs,
}) => Verses(  id: id ?? _id,
  verseNumber: verseNumber ?? _verseNumber,
  verseKey: verseKey ?? _verseKey,
  hizbNumber: hizbNumber ?? _hizbNumber,
  rubElHizbNumber: rubElHizbNumber ?? _rubElHizbNumber,
  rukuNumber: rukuNumber ?? _rukuNumber,
  manzilNumber: manzilNumber ?? _manzilNumber,
  sajdahNumber: sajdahNumber ?? _sajdahNumber,
  textUthmani: textUthmani ?? _textUthmani,
  pageNumber: pageNumber ?? _pageNumber,
  juzNumber: juzNumber ?? _juzNumber,
  words: words ?? _words,
  audio: audio ?? _audio,
  translations: translations ?? _translations,
  tafsirs: tafsirs ?? _tafsirs,
);
  num? get id => _id;
  num? get verseNumber => _verseNumber;
  String? get verseKey => _verseKey;
  num? get hizbNumber => _hizbNumber;
  num? get rubElHizbNumber => _rubElHizbNumber;
  num? get rukuNumber => _rukuNumber;
  num? get manzilNumber => _manzilNumber;
  dynamic get sajdahNumber => _sajdahNumber;
  String? get textUthmani => _textUthmani;
  num? get pageNumber => _pageNumber;
  num? get juzNumber => _juzNumber;
  List<Words>? get words => _words;
  Audio? get audio => _audio;
  List<Translations>? get translations => _translations;
  List<Tafsirs>? get tafsirs => _tafsirs;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['id'] = _id;
    map['verse_number'] = _verseNumber;
    map['verse_key'] = _verseKey;
    map['hizb_number'] = _hizbNumber;
    map['rub_el_hizb_number'] = _rubElHizbNumber;
    map['ruku_number'] = _rukuNumber;
    map['manzil_number'] = _manzilNumber;
    map['sajdah_number'] = _sajdahNumber;
    map['text_uthmani'] = _textUthmani;
    map['page_number'] = _pageNumber;
    map['juz_number'] = _juzNumber;
    if (_words != null) {
      map['words'] = _words?.map((v) => v.toJson()).toList();
    }
    if (_audio != null) {
      map['audio'] = _audio?.toJson();
    }
    if (_translations != null) {
      map['translations'] = _translations?.map((v) => v.toJson()).toList();
    }
    if (_tafsirs != null) {
      map['tafsirs'] = _tafsirs?.map((v) => v.toJson()).toList();
    }
    return map;
  }

}

/// id : 67135
/// resource_id : 165
/// text : "<p>অনন্ত করুণাময় পরম দয়ালু আল্লাহর নামে (আরম্ভ করছি)।</p><p>'বিসমিল্লাহ'র পূর্বে 'আক্বরাউ' 'আবদাউ' অথবা 'আতলু' ফে'ল (ক্রিয়া) উহ্য আছে। অর্থাৎ, আল্লাহর নাম নিয়ে পড়ছি অথবা শুরু করছি কিংবা তেলাঅত আরম্ভ করছি। প্রত্যেক গুরুত্বপূর্ণ কাজ আরম্ভ করার পূর্বে 'বিসমিল্লাহ' পড়ার প্রতি তাকীদ করা হয়েছে। সুতরাং নির্দেশ করা হয়েছে যে, খাওয়া, যবেহ করা, ওযু করা এবং সহবাস করার পূর্বে 'বিসমিল্লাহ' পড়। অবশ্য ক্বুরআনে করীম তেলাঅত করার সময় 'বিসমিল্লাহির রাহমানির রাহীম' পড়ার পূর্বে 'আউযু বিল্লাহি মিনাশ্শায়ত্বানির রাজীম' পড়াও অত্যাবশ্যক। মহান আল্লাহ বলেছেন, \"অতএব যখন তুমি ক্বুরআন পাঠ করবে, তখন বিতাড়িত শয়তান থেকে আল্লাহর আশ্রয় প্রার্থনা কর।\" <em>(সূরা নাহল ১৬:৯৮ আয়াত)।</em></p>"

Tafsirs tafsirsFromJson(String str) => Tafsirs.fromJson(json.decode(str));
String tafsirsToJson(Tafsirs data) => json.encode(data.toJson());
class Tafsirs {
  Tafsirs({
      num? id, 
      num? resourceId, 
      String? text,}){
    _id = id;
    _resourceId = resourceId;
    _text = text;
}

  Tafsirs.fromJson(dynamic json) {
    _id = json['id'];
    _resourceId = json['resource_id'];
    _text = json['text'];
  }
  num? _id;
  num? _resourceId;
  String? _text;
Tafsirs copyWith({  num? id,
  num? resourceId,
  String? text,
}) => Tafsirs(  id: id ?? _id,
  resourceId: resourceId ?? _resourceId,
  text: text ?? _text,
);
  num? get id => _id;
  num? get resourceId => _resourceId;
  String? get text => _text;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['id'] = _id;
    map['resource_id'] = _resourceId;
    map['text'] = _text;
    return map;
  }

}

/// id : 1065242
/// resource_id : 106
/// text : "Ша сов къинхетаме<sup foot_note=111781>1</sup> а‚ къинхетаме<sup foot_note=111782>2</sup> а волчу Делан цIарца."

Translations translationsFromJson(String str) => Translations.fromJson(json.decode(str));
String translationsToJson(Translations data) => json.encode(data.toJson());
class Translations {
  Translations({
      num? id, 
      num? resourceId, 
      String? text,}){
    _id = id;
    _resourceId = resourceId;
    _text = text;
}

  Translations.fromJson(dynamic json) {
    _id = json['id'];
    _resourceId = json['resource_id'];
    _text = json['text'];
  }
  num? _id;
  num? _resourceId;
  String? _text;
Translations copyWith({  num? id,
  num? resourceId,
  String? text,
}) => Translations(  id: id ?? _id,
  resourceId: resourceId ?? _resourceId,
  text: text ?? _text,
);
  num? get id => _id;
  num? get resourceId => _resourceId;
  String? get text => _text;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['id'] = _id;
    map['resource_id'] = _resourceId;
    map['text'] = _text;
    return map;
  }

}

/// url : "AbdulBaset/Mujawwad/mp3/001001.mp3"
/// segments : [[0,1,0,960],[1,2,970,1420],[2,3,1430,2670],[3,4,2680,6210]]

Audio audioFromJson(String str) => Audio.fromJson(json.decode(str));
String audioToJson(Audio data) => json.encode(data.toJson());
class Audio {
  Audio({
      String? url, 
      List<String>? segments,}){
    _url = url;
    _segments = segments;
}

  Audio.fromJson(dynamic json) {
    _url = "https://verses.quran.com/${json['url']}";
    // _segments = json['segments']!=null ? json['segments'].map((s)=>s.toString()):[];
  }
  String? _url;
  List<String>? _segments;
Audio copyWith({  String? url,
  List<String>? segments,
}) => Audio(  url: url ?? _url,
  segments: segments ?? _segments,
);
  String? get url => _url;
  List<String>? get segments => _segments;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['url'] = _url;
    map['segments'] = _segments;
    return map;
  }

}

/// id : 1
/// position : 1
/// audio_url : "wbw/001_001_001.mp3"
/// char_type_name : "word"
/// text_uthmani : "بِسْمِ"
/// page_number : 1
/// line_number : 2
/// text : "بِسْمِ"
/// translation : {"text":"In (the) name","language_name":"english"}
/// transliteration : {"text":"bis'mi","language_name":"english"}

Words wordsFromJson(String str) => Words.fromJson(json.decode(str));
String wordsToJson(Words data) => json.encode(data.toJson());
class Words {
  Words({
      num? id, 
      num? position, 
      String? audioUrl, 
      String? charTypeName, 
      String? textUthmani, 
      num? pageNumber, 
      num? lineNumber, 
      String? text, 
      Translation? translation, 
      Transliteration? transliteration,}){
    _id = id;
    _position = position;
    _audioUrl = audioUrl;
    _charTypeName = charTypeName;
    _textUthmani = textUthmani;
    _pageNumber = pageNumber;
    _lineNumber = lineNumber;
    _text = text;
    _translation = translation;
    _transliteration = transliteration;
}

  Words.fromJson(dynamic json) {
    _id = json['id'];
    _position = json['position'];
    _audioUrl = json['audio_url'];
    _charTypeName = json['char_type_name'];
    _textUthmani = json['text_uthmani'];
    _pageNumber = json['page_number'];
    _lineNumber = json['line_number'];
    _text = json['text'];
    _translation = json['translation'] != null ? Translation.fromJson(json['translation']) : null;
    _transliteration = json['transliteration'] != null ? Transliteration.fromJson(json['transliteration']) : null;
  }
  num? _id;
  num? _position;
  String? _audioUrl;
  String? _charTypeName;
  String? _textUthmani;
  num? _pageNumber;
  num? _lineNumber;
  String? _text;
  Translation? _translation;
  Transliteration? _transliteration;
Words copyWith({  num? id,
  num? position,
  String? audioUrl,
  String? charTypeName,
  String? textUthmani,
  num? pageNumber,
  num? lineNumber,
  String? text,
  Translation? translation,
  Transliteration? transliteration,
}) => Words(  id: id ?? _id,
  position: position ?? _position,
  audioUrl: audioUrl ?? _audioUrl,
  charTypeName: charTypeName ?? _charTypeName,
  textUthmani: textUthmani ?? _textUthmani,
  pageNumber: pageNumber ?? _pageNumber,
  lineNumber: lineNumber ?? _lineNumber,
  text: text ?? _text,
  translation: translation ?? _translation,
  transliteration: transliteration ?? _transliteration,
);
  num? get id => _id;
  num? get position => _position;
  String? get audioUrl => _audioUrl;
  String? get charTypeName => _charTypeName;
  String? get textUthmani => _textUthmani;
  num? get pageNumber => _pageNumber;
  num? get lineNumber => _lineNumber;
  String? get text => _text;
  Translation? get translation => _translation;
  Transliteration? get transliteration => _transliteration;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['id'] = _id;
    map['position'] = _position;
    map['audio_url'] = _audioUrl;
    map['char_type_name'] = _charTypeName;
    map['text_uthmani'] = _textUthmani;
    map['page_number'] = _pageNumber;
    map['line_number'] = _lineNumber;
    map['text'] = _text;
    if (_translation != null) {
      map['translation'] = _translation?.toJson();
    }
    if (_transliteration != null) {
      map['transliteration'] = _transliteration?.toJson();
    }
    return map;
  }

}

/// text : "bis'mi"
/// language_name : "english"

Transliteration transliterationFromJson(String str) => Transliteration.fromJson(json.decode(str));
String transliterationToJson(Transliteration data) => json.encode(data.toJson());
class Transliteration {
  Transliteration({
      String? text, 
      String? languageName,}){
    _text = text;
    _languageName = languageName;
}

  Transliteration.fromJson(dynamic json) {
    _text = json['text'];
    _languageName = json['language_name'];
  }
  String? _text;
  String? _languageName;
Transliteration copyWith({  String? text,
  String? languageName,
}) => Transliteration(  text: text ?? _text,
  languageName: languageName ?? _languageName,
);
  String? get text => _text;
  String? get languageName => _languageName;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['text'] = _text;
    map['language_name'] = _languageName;
    return map;
  }

}

/// text : "In (the) name"
/// language_name : "english"

Translation translationFromJson(String str) => Translation.fromJson(json.decode(str));
String translationToJson(Translation data) => json.encode(data.toJson());
class Translation {
  Translation({
      String? text, 
      String? languageName,}){
    _text = text;
    _languageName = languageName;
}

  Translation.fromJson(dynamic json) {
    _text = json['text'];
    _languageName = json['language_name'];
  }
  String? _text;
  String? _languageName;
Translation copyWith({  String? text,
  String? languageName,
}) => Translation(  text: text ?? _text,
  languageName: languageName ?? _languageName,
);
  String? get text => _text;
  String? get languageName => _languageName;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['text'] = _text;
    map['language_name'] = _languageName;
    return map;
  }

}